[
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda5eb"
    },
    "id": 109536,
    "url": "https://jobicy.com/jobs/109536-applied-scientist-intern-phd-fall-2024",
    "jobSlug": "109536-applied-scientist-intern-phd-fall-2024",
    "jobTitle": "Applied Scientist Intern - PhD (Winter 2025)",
    "companyName": "Splunk",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/09/2f9304fe9b427489507405bef9a0bb9f.jpg",
    "jobIndustry": ["Data Science"],
    "jobType": ["internship"],
    "jobGeo": "USA",
    "jobLevel": "Any",
    "jobExcerpt": "Splunk is here to build a safer and more resilient digital world. The world&#8217;s leading enterprises use our unified security and observability platform to keep their digital systems secure and reliable. While customers love our technology, it&#8217;s our people that make Splunk stand out as an amazing career destination and why we&#8217;ve won so many&#8230;",
    "jobDescription": "<div>Splunk is here to build a safer and more resilient digital world. The world&#8217;s leading enterprises use our unified security and observability platform to keep their digital systems secure and reliable. While customers love our technology, it&#8217;s our people that make Splunk stand out as an amazing career destination and why we&#8217;ve won so many awards as a best place to work. If you become a Splunker, we want your whole, authentic self, what we call your &#8220;million data points&#8221;. So bring your work experience, problem-solving skills and talent, of course, but also bring your joy, your passion and all the things that make you, you.</div>\n<h2>Role Summary</h2>\n<div>This is a remote-only role and will not require relocation. We welcome applicants from anywhere in the US.</div>\n<div>Splunk is looking for PhD students to join our team for Winter 2025! As an Applied Scientist intern, you will work on a real project (or a few) and have an opportunity to enjoy our dynamic, startup-like environment. You will engage in cutting-edge projects primarily centered on Generative AI, AI assistants, and scalable time series analysis, including anomaly detection and predictive analysis.</div>\n<div>You will experience Splunking and what defines our culture while honing the skills which separate our development teams from others. Working to support internal and external customer needs, you will collaborate with multi-functional teams, receive mentorship, and gain insight into our values-driven process. Our goal is both to support your growth and development while empowering you for a successful start to your career.c</div>\n<h2>What you&#8217;ll get to do</h2>\n<ul>\n<li>Achieve data science and software engineering goals set by you, your manager, and your mentor</li>\n<li>Drive deliverables on topics such as Generative AI, AI assistants, and scalable time series analysis</li>\n<li>Learn about Splunk, both the product and the company</li>\n<li>Work and socialize with other interns and full-time Splunkers</li>\n</ul>\n<h2>Must-have Qualifications</h2>\n<ul>\n<li>Actively pursuing a PhD in Computer Science, Software Engineering, Computer Engineering, Electrical Engineering, Mathematics or a related technical field, and a strong record of academic achievement.</li>\n<li>At least one semester/quarter remaining to complete after the internship</li>\n<li>Available to work 40 hours a week for 15 weeks from January 6 &#8211; April 18, 2025</li>\n</ul>\n<h2>Nice-to-have Qualifications</h2>\n<div>We’ve taken special care to separate the must-have qualifications from the nice-to-haves. “Nice-to-have” means just that: Nice. To. Have. So, don’t worry if you can’t check off every box. We’re not hiring a list of bullet points–we’re interested in the whole you.</div>\n<ul>\n<li>Coursework and research experience in machine learning, either Generative AI technology and Large Language Models (LLM)</li>\n<li>Coursework and research experience with time series analysis (univariate and multivariate) with a focus on anomaly detection.</li>\n<li>Experience with ML frameworks (e.g., TensorFlow, PyTorch) and Python.</li>\n<li>Ability to work well with others in a fast-paced environment.</li>\n<li>Experience working in an agile environment.</li>\n<li>Strong communication skills, verbal and written.</li>\n<li>Enthusiasm for solving interesting problems.</li>\n<li>Experience programming in a large software project – at school, professionally, or in an open source context.</li>\n</ul>\n<div><b>Splunk is an Equal Opportunity Employer</b></div>\n<div>At Splunk, we believe creating a culture of belonging isn’t just the right thing to do; it’s also the smart thing. We prioritize diversity, equity, inclusion, and belonging to ensure our employees are supported to bring their best, most authentic selves to work where they can thrive. Qualified applicants receive consideration for employment without regard to race, religion, color, national origin, ancestry, sex, gender, gender identity, gender expression, sexual orientation, marital status, age, physical or mental disability or medical condition, genetic information, veteran status, or any other consideration made unlawful by federal, state, or local laws. We consider qualified applicants with criminal histories, consistent with legal requirements.</div>\n<h2><b>Base Pay Range</b></h2>\n<p>SF Bay Area, Seattle Metro and New York City Metro Area<br />\nBase Pay: $82 per hour</p>\n<p>California (excludes SF Bay Area), Washington (excludes Seattle Metro), Washington DC Metro, and Massachusetts<br />\nBase Pay: $75 per hour</p>\n<p>All other cities and states excluding California, Washington, Massachusetts, New York City Metro Area and Washington DC Metro Area.<br />\nBase Pay: $67 per hour</p>\n<p>Splunk provides flexibility and choice in the working arrangement for most roles, including remote and/or in-office roles. We have a market-based pay structure which varies by location. Please note that the base pay range is a guideline and for candidates who receive an offer, the base pay will vary based on factors such as work location as set out above, as well as the knowledge, skills, year in school and experience of the candidate. In addition to base pay, this role may be eligible for benefits.</p>",
    "pubDate": "2024-09-12 07:59:26",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda5ec"
    },
    "id": 107517,
    "url": "https://jobicy.com/jobs/107517-staff-backend-engineer",
    "jobSlug": "107517-staff-backend-engineer",
    "jobTitle": "Staff Backend Engineer",
    "companyName": "FirstbaseHQ",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/09/0957540f8833648730fb94c40501bbd3.jpg",
    "jobIndustry": ["Software Engineering"],
    "jobType": ["full-time"],
    "jobGeo": "Europe,  UK,  USA",
    "jobLevel": "Any",
    "jobExcerpt": "Firstbase was set up as a fully remote company from the start. We don’t have a physical office, and our small but mighty team is distributed across North America and Europe. We are makers at heart—whether it&#8217;s coding, drafting product briefs, or designing, we’re committed to creating high-quality, delightful products. Our remote nature means we&#8230;",
    "jobDescription": "<p>Firstbase was set up as a fully remote company from the start. We don’t have a physical office, and our small but mighty team is distributed across North America and Europe. We are makers at heart—whether it&#8217;s coding, drafting product briefs, or designing, we’re committed to creating high-quality, delightful products. Our remote nature means we value clear, effective written communication for coordinating tasks and discussions across various platforms like Slack and Linear. Decision-making is swift; we aim to advance conversations and reach conclusions quickly.</p>\n<p>We are looking for experienced individuals who are passionate about their work&#8217;s impact, thrive in a collaborative remote environment, and are keen on solving problems end to end. If you&#8217;re driven to produce exceptional work and keen to shape the future of remote work, Firstbase might be the perfect place for you.</p>\n<p><em>Salary Range: 160K &#8211; 220K USD. (Final offer amounts are determined by multiple factors, including candidate location, experience and expertise, and may vary from the amounts listed)</em></p>\n<h2><strong>Your Responsibilities will include, but are not limited to</strong></h2>\n<ul>\n<li>Building delightful customer facing features in our platform.</li>\n<li>Building internal tools to support our Operations and Finance teams.</li>\n<li>Helping to scale our integrations with other HRIS, ITSM and MDM providers.</li>\n<li>Helping to improve infrastructure performance and optimize architecture for scalability.</li>\n<li>Improving observability, monitoring, and alerting systems, ensuring rapid response and minimal downtime in operational incidents.</li>\n</ul>\n<h2><strong>Tech we Use</strong></h2>\n<ul>\n<li>Java, Kotlin, Postgres, and Redis</li>\n<li>Internal GraphQL API and Public REST API</li>\n<li>Hosted on AWS with Kubernetes</li>\n<li>Gitlab, Slack, Notion, Retool</li>\n</ul>\n<h2><strong>Benefits</strong></h2>\n<ul>\n<li>Challenging and highly impactful work.</li>\n<li>Work-life balance.</li>\n<li>Competitive salary and equity.</li>\n<li>Full-remote, no commuting required.</li>\n<li>Health, Dental and Vision Insurance coverage.</li>\n<li>401K with company match (for US employees only).</li>\n<li>3 months of paid parental leave.</li>\n<li>Flexible vacation time off.</li>\n<li>Choose your gear powered by Firstbase</li>\n</ul>\n<p>We’re committed to building a culturally diverse team and strongly encourage you to apply regardless of your location, background, race, gender, sexual orientation or any other personally defining attribute. We encourage every person who is interested to apply. We’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply. Take the leap &#8211; you never know, you might just be the perfect person for one of our open roles, even if you don’t match 100% of the job description.</p>",
    "pubDate": "2024-09-12 07:57:42",
    "annualSalaryMin": "160000",
    "annualSalaryMax": "220000",
    "salaryCurrency": "USD",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda5ed"
    },
    "id": 79634,
    "url": "https://jobicy.com/jobs/79634-customer-experience-associate-6",
    "jobSlug": "79634-customer-experience-associate-6",
    "jobTitle": "Business Development Representative",
    "companyName": "FirstbaseHQ",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/09/0957540f8833648730fb94c40501bbd3.jpg",
    "jobIndustry": ["Business Development", "Sales"],
    "jobType": ["full-time"],
    "jobGeo": "USA",
    "jobLevel": "Any",
    "jobExcerpt": "Remote work is the biggest workplace revolution in history. Nothing will deliver a higher quality of life upgrade in the next decade. The biggest challenge is in providing the core infrastructure that makes going remote easy for companies. Firstbase helps companies setup, manage, maintain and retrieve all the physical equipment remote workers need to do&#8230;",
    "jobDescription": "<p>Remote work is the biggest workplace revolution in history. Nothing will deliver a higher quality of life upgrade in the next decade. The biggest challenge is in providing the core infrastructure that makes going remote easy for companies. Firstbase helps companies setup, manage, maintain and retrieve all the physical equipment remote workers need to do great work at home.</p>\n<p>We&#8217;re a small and fully distributed team, currently spanning from the US to Belgium and we take pride in our ability to function as an effective remote-first organization. We offer market-rate salaries (including equity), a home office (via Firstbase), insurance, as many books as you could ever hope to read, and a tight-knit group of people passionate about creating for the future of work.</p>\n<h2><strong>About This Position</strong></h2>\n<p>A Business Development Representative at Firstbase is an outbound role, meaning you are responsible for finding, contacting, and converting leads through your own efforts. The BDR, in conjunction with their assigned Account Executive(s), is responsible for owning and managing the prospecting for a designated territory and is responsible for creating quarterly plans to achieve quotas. Daily activities include conducting prospect and account research, working in parallel to your Inbound BDR peer, social media messaging, email messaging, and outbound calling.</p>\n<p><em>This is a remote position that can be done from anywhere in the U.S.  Salary Range: $60,000- $70,000</em></p>\n<h2><strong>Key Responsibilities</strong></h2>\n<ul>\n<li>Grow territory by adding new contacts and accounts using tools such as LinkedIn Sales Navigator, LinkedIn Insights, ZoomInfo, and LeadIQ</li>\n<li>Complete tasks related to Outbound Lead Generation including conducting account research, prospect research, and reaching out to prospects via email, cold calls, and social media messaging.</li>\n<li>Growing your network on LinkedIn and leveraging it to find and convert leads</li>\n<li>Working with Account Executive(s) on outbound strategies</li>\n<li>Working with Inbound BDR on accounts/prospects that come in via Marketing Campaigns</li>\n<li>Inputting and updating data in Salesforce</li>\n</ul>\n<h2><strong>Desired Skills &amp; Experience</strong></h2>\n<ul>\n<li>Previous experience as a BDR/BDR &#8211; 9+ months preferred</li>\n<li>Experience prospecting/selling into Enterprise/Strategic Accounts</li>\n<li>Consistently meet/exceed sales quotas within specified time frames</li>\n<li>Experience working in a high grow-tech company</li>\n<li>Working knowledge of Salesloft/Outreach.io , Salesforce, LinkedIn Sales Navigator, and LeadIQ</li>\n<li>Previous experience in B2B Software Sales</li>\n<li>Self-starter  -Ability to demonstrate successfully working remote</li>\n<li>Basic understanding of what presales is</li>\n<li>Bachelor&#8217;s degree or equivalent field experience</li>\n</ul>\n<h2><strong>Role Requirements</strong></h2>\n<ul>\n<li>Experience working in high growth startup environments: You have the ability to move fast, adapt, and thrive in a dynamic startup environment where you derive priorities, requirements, and goals from company context.</li>\n<li>Collaborative: You are ready to roll up your sleeves and create strategies that work across roles and departments to achieve company goals.</li>\n<li>A Clear Communicator: You effectively and positively present your informed opinions on strategy clearly to multiple teams and areas of expertise. You come with a solid rationale behind every decision you make, you understand the importance of listening as part of communication.</li>\n</ul>\n<p>We’re committed to building a culturally diverse team and strongly encourage you to apply regardless of your location, background, race, gender, sexual orientation or any other personally defining attribute. We encourage every person who is interested to apply. We’re imperfect communicators, so think of our job postings as the starting point for discussion rather than proof that you shouldn’t apply. Take the leap &#8211; you never know, you might just be the perfect person for one of our open roles, even if you don’t match 100% of the job description.</p>",
    "pubDate": "2024-09-12 07:57:30",
    "annualSalaryMin": "60000",
    "annualSalaryMax": "70000",
    "salaryCurrency": "USD",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda5ee"
    },
    "id": 110650,
    "url": "https://jobicy.com/jobs/110650-senior-paid-social-media-manager",
    "jobSlug": "110650-senior-paid-social-media-manager",
    "jobTitle": "Senior Paid Social Media Manager",
    "companyName": "Canva",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/12/WRILS-201227212703-643638.png",
    "jobIndustry": ["Social Media Marketing"],
    "jobType": ["full-time"],
    "jobGeo": "Anywhere",
    "jobLevel": "Senior",
    "jobExcerpt": "Our flagship campus is in Sydney. We also have a campus in Melbourne and co-working spaces in Brisbane, Perth and Adelaide. But you have choice in where and how you work, we trust our Canvanauts to choose the balance that empowers them and their team to achieve their goals. What you’d be doing in this&#8230;",
    "jobDescription": "<p>Our flagship campus is in Sydney. We also have a campus in Melbourne and co-working spaces in Brisbane, Perth and Adelaide. But you have choice in where and how you work, we trust our Canvanauts to choose the balance that empowers them and their team to achieve their goals.</p>\n<h2><strong>What you’d be doing in this role</strong></h2>\n<p>As Canva scales change continues to be part of our DNA. But we like to think that&#8217;s all part of the fun. So this will give you the flavour of the type of things you&#8217;ll be working on when you start, but this will likely evolve.</p>\n<h2>At the moment, this role is focused on:</h2>\n<ul>\n<li>Campaign Management &#8211; Scale, manage &amp; optimise paid social campaign efforts</li>\n<li>Intl Growth Teams Collaboration: Collaborate with international growth marketing teams &amp; provide strategic input for paid social brand efforts</li>\n<li>Share our wins &amp; learnings &#8211; Communicate accurate and timely weekly reports on the</li>\n<li>performance of your campaigns to the team &amp; wider stakeholders.</li>\n<li>Be the subject-matter expert &#8211; Work with paid social teams and internal teams to ensure we’re at the forefront of performance marketing on paid social.</li>\n<li>Be a team player &#8211; Involvement with other marketing, product and growth activities as needed.</li>\n<li>Make complex things simple &#8211; Find new ways to improve efficiency both in terms of performance and process.</li>\n<li>Help drive our digital strategy &#8211; The role will be focused on driving the digital strategy across multiple parts of the funnel and supporting efforts in a growing number of international markets.</li>\n</ul>\n<h2><strong>You&#8217;re probably a match if</strong></h2>\n<ul>\n<li>You have at least 6+ years of digital marketing experience and have had hands on keyboard running paid social/paid social campaigns</li>\n<li>You have a deep knowledge of the digital landscape across Channels, Platforms &amp; Digital Environments including paid social Audio, Video &amp; paid social</li>\n<li>You have worked on international marketing campaigns and stakeholders in performance marketing and understand the nuances of localized campaign efforts</li>\n<li>You have worked with complex cross-functional teams/agencies to build integrated campaigns</li>\n<li>You have worked with adtech/data teams to prioritize your platform/measurement needs</li>\n<li>You have a strong understanding of brand measurement tools and how to measure/optimize campaigns</li>\n</ul>\n<h2><strong>About the team</strong></h2>\n<p>Canva’s B2C Marketing Group has a big mission to build the most loved brand in the world! Our success is shaping how we communicate and relate to our community, and guide teams internally to deliver delightful product experiences and communications.</p>\n<p>We’re looking for an experienced paid social leader to scale our global paid social efforts, working closely alongside some of the top performance marketing leaders in the world. You’ll thrive in a fast-moving, fluid environment, and be passionate about shaping user-centric experiences, communications, and working with diverse groups of people across the organisation to achieve your goals.</p>\n<p>As part of the team, you will drive the global strategy and expansion of paid social as a channel to deliver accelerated business growth across multiple product lines. We work closely with other marketers, engineers and designers to exponentially grow Canva’s users &amp; revenue.</p>\n<p>You’ll thrive in a fast-moving, fluid environment, and be passionate about shaping user-centric experiences, communications, and working with diverse groups of people across the organisation to achieve your goals.</p>\n<p>As part of the team, you will manage our paid social advertising efforts across key markets to drive accelerated business growth across multiple countries. We work closely with marketers, engineers, designers to exponentially grow Canva’s users &amp; revenue</p>\n<h2><strong>What&#8217;s in it for you?</strong></h2>\n<p>Achieving our crazy big goals motivates us to work hard &#8211; and we do &#8211; but you&#8217;ll experience lots of moments of magic, connectivity and fun woven throughout life at Canva, too. We also offer a range of benefits to set you up for every success in and outside of work.</p>\n<p>Here&#8217;s a taste of what&#8217;s on offer:</p>\n<ul>\n<li>Equity packages &#8211; we want our success to be yours too</li>\n<li>Inclusive parental leave policy that supports all parents &amp; carers</li>\n<li>An annual Vibe &amp; Thrive allowance to support your wellbeing, social connection, office setup &amp; more</li>\n<li>Flexible leave options that empower you to be a force for good, take time to recharge and supports you personally</li>\n</ul>\n<p>Check out lifeatcanva.com for more info.</p>\n<h2><strong>Other stuff to know</strong></h2>\n<p>We make hiring decisions based on your experience, skills and passion, as well as how you can enhance Canva and our culture. When you apply, please tell us the pronouns you use and any reasonable adjustments you may need during the interview process.</p>\n<p>We celebrate all types of skills and backgrounds at Canva so even if you don’t feel like your skills quite match what’s listed above &#8211; we still want to hear from you!</p>",
    "pubDate": "2024-09-12 07:55:39",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda5ef"
    },
    "id": 110649,
    "url": "https://jobicy.com/jobs/110649-senior-content-designer",
    "jobSlug": "110649-senior-content-designer",
    "jobTitle": "Senior Content Designer",
    "companyName": "Elevate Labs",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/09/2a91e6dd8e692441f162807b01229672.jpg",
    "jobIndustry": ["Copywriting &amp; Content"],
    "jobType": ["full-time"],
    "jobGeo": "LATAM,  Canada,  USA",
    "jobLevel": "Senior",
    "jobExcerpt": "We’ve helped millions of people around the world learn and improve concrete communication, memory, and math skills through Elevate, our first mobile app which has won Apple&#8217;s App of the Year Award and been downloaded more than 60 million times. With Balance, our second mobile app and winner of Google&#8217;s Best App award, we’ve personalized&#8230;",
    "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>We’ve helped millions of people around the world learn and improve concrete communication, memory, and math skills through Elevate, our first mobile app which has won Apple&#8217;s App of the Year Award and been downloaded more than 60 million times. With Balance, our second mobile app and winner of Google&#8217;s Best App award, we’ve personalized meditation and made it free for an entire year to help more people reduce stress, improve sleep, sharpen focus, and much more.</div>\n<div></div>\n<div>Elevate Labs is a fully remote company of voracious learners and passionate doers, driven by our vision to help billions of people lead healthy, joyful, and productive lives.</div>\n<div></div>\n<div>If our mission resonates with you, please consider applying!</div>\n<div></div>\n<div>We&#8217;re looking for an autonomous, proactive Senior Content Designer to work with the Balance product team.</div>\n<div>In this role, you&#8217;ll help tackle complex end-to-end product problems and perform a wide array of UX writing tasks for our award-winning meditation and sleep app.</div>\n<div></div>\n<div>The ideal candidate has a strong bias for action, generalist mindset, and experience working collaboratively with an agile cross-functional product team. They&#8217;re also a versatile UX writer and problem-solver with a desire to both contribute to and spearhead new projects in a fast-paced environment.</div>\n<div></div>\n<div>This is a fully remote position anywhere in North America or South America.</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>How you&#8217;ll make an impact here:</h2>\n<ul>\n<li>Write intuitive copy that creates a meaningful, cohesive experience and helps our customers easily navigate through Balance</li>\n<li>Collaborate with Product Managers, Designers, Engineers, and other Content team members to solve complex product problems</li>\n<li>Collaborate with Data Analytics, Customer Support, and Marketing team members to develop a deep understanding of our products and how our customers interact with them</li>\n<li>Write and review UX product copy in Figma wireframes</li>\n<li>Analyze existing product content, focusing on opportunities for improvement</li>\n<li>Create multiple versions of product copy for A/B test experiments, with the goal of optimizing every step of the UX</li>\n<li>Maintain a generalist mindset, proactively flexing into game, meditation, and other types of content work as needed</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Qualifications:</h2>\n<ul>\n<li>6+ years of UX writing experience, with at least some experience working on mobile apps</li>\n<li>Solid understanding of UX writing principles, processes, and best practices</li>\n<li>Superior project management skills within a high-velocity environment</li>\n<li>Ability to distill complex ideas down into approachable language</li>\n<li>Customer obsession and extreme passion for user-focused product experiences</li>\n<li>Excitement about testing and iterating on your work, leaning on data and user research to inform your decisions</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Bonus:</h2>\n<ul>\n<li>Experience working in a remote environment</li>\n<li>Experience working in the education, meditation, and/or health and wellness fields</li>\n<li>Experience working at a lean startup</li>\n<li>Experience with growth and monetization content</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Benefits:</h2>\n<ul>\n<li>Competitive salary and equity</li>\n<li>Medical, dental, and vision insurance for you and your family</li>\n<li>Distributed team flexibility, with a home-office stipend and co-working reimbursement</li>\n<li>Annual learning, wellness, and travel stipends</li>\n<li>Generous PTO, flexible sick leave, and paid parental leave</li>\n<li>Annual company meetup in a fun location</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\" data-qa=\"closing-description\">\n<h2><b>How we hire:</b></h2>\n<div>We seek to build high-impact, talent-dense teams. To help us assess your skills, you can expect approximately three conversational-style interview rounds, plus a portfolio review and skills challenge.</div>\n<div></div>\n<div><b>Our Commitment to Diversity, Equity, &amp; Inclusion:</b></div>\n<div>We believe that there is no single candidate profile that guarantees success in this role. Experience comes in different forms; many skills are transferable, and passion goes a long way. If your background is similar to the job description and you think you can excel in this role, please apply and tell us about yourself and the impact you could make at Elevate Labs.</div>\n</div>",
    "pubDate": "2024-09-12 07:51:47",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda5f0"
    },
    "id": 109538,
    "url": "https://jobicy.com/jobs/109538-sr-growth-marketing-manager-creative-strategy",
    "jobSlug": "109538-sr-growth-marketing-manager-creative-strategy",
    "jobTitle": "Senior Growth Marketing Manager, Creative Strategy",
    "companyName": "Elevate Labs",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/09/2a91e6dd8e692441f162807b01229672.jpg",
    "jobIndustry": ["Marketing &amp; Sales"],
    "jobType": ["full-time"],
    "jobGeo": "LATAM,  Canada,  USA",
    "jobLevel": "Senior",
    "jobExcerpt": "We’re looking for a Sr. Growth Marketing Manager &#8211; Creative Strategy with an analytical mindset and strong communication and collaboration skills to run an effective creative engine for consistent creative wins. The Growth Marketing team at Elevate is a lean, agile, and high-impact team driving ambitious company growth goals. Over the last couple of years,&#8230;",
    "jobDescription": "<p>We’re looking for a Sr. Growth Marketing Manager &#8211; Creative Strategy with an analytical mindset and strong communication and collaboration skills to run an effective creative engine for consistent creative wins.</p>\n<p>The Growth Marketing team at Elevate is a lean, agile, and high-impact team driving ambitious company growth goals. Over the last couple of years, we scaled Elevate and Balance to over 60M downloads. You will be an integral member of the growth marketing team, and take our apps’ growth to the next level by bridging rigorous data analytics with creative thinking.</p>\n<p>The ideal candidate has a strong desire to learn and adapt, thrives in a fast-paced, dynamic environment, and understands the nuances of performant paid social ads.</p>\n<p>This is a fully remote position based anywhere in North or South America. We are happy to sponsor US visas and green cards, if applicable.</p>\n<h2>How You&#8217;ll Make an Impact Here</h2>\n<ul>\n<li>You will champion visionary creative strategy and initiatives that push the boundaries of innovation and velocity to grow our brands’ market presence to new heights.</li>\n<li>You will build strategic creative roadmaps and hypotheses that are based on paid social trends, testing results, and audience segmentations.</li>\n<li>You will lead cross-functional creative discussions around creative performance data, strategic insights, and creative ideas, melding rigorous data analytics with creative thinking and industry best practices.</li>\n<li>You will write effective creative briefs and performant ad copy/scripts.</li>\n<li>You will bring optimism, positivity, and efficacy in working relationships and meeting facilitation with cross-functional stakeholders.</li>\n<li>You will continually look for ways to streamline the creative development process and reduce turnaround time.</li>\n</ul>\n<h2>Qualifications</h2>\n<ul>\n<li>5+ years in media buying and creative strategy roles (combined), with 1+ years in an in-house environment</li>\n<li>Experience with social media platforms (Meta, Twitter, LinkedIn, Pinterest, TikTok, Snap) in a marketing capacity</li>\n<li>Deep understanding of how to automate processes and improve creative testing velocity while not sacrificing the quality of creative concepts</li>\n<li>Strong track record of developing performant ad concepts, and skilled at taking creative ideas from 0 to 1 with minimal oversight</li>\n<li>Knowledge in data analysis and digital marketing KPIs (CTR, CPA, ROAS) with the ability to make data-driven decisions using data analytic tools such as Excel, Gsheet, Tableau, Looker, etc.</li>\n<li>Exceptional copywriting skills and attention to detail</li>\n<li>Cross-functional collaborator with highly effective communication skills</li>\n<li>Go-getter and master researcher &#8211; proactively seek solutions and knowledge</li>\n</ul>\n<h2>Bonus</h2>\n<ul>\n<li>Experiences at an early-stage startup with a focus on the subscription app space</li>\n<li>Passion for education, mental fitness, and/or mobile apps</li>\n</ul>\n<h3>Benefits</h3>\n<ul>\n<li>Competitive salary and equity</li>\n<li>Medical, dental, and vision insurance for you and your family</li>\n<li>Distributed team flexibility, with a home-office stipend and co-working reimbursement</li>\n<li>Annual learning, wellness, and travel stipends</li>\n<li>Generous PTO, flexible sick leave, and paid parental leave</li>\n<li>Annual company meetup in a fun location</li>\n</ul>\n<h2><b>How We Hire</b></h2>\n<p>At Elevate Labs, we seek to build high-impact teams with high talent density, and we invest a lot of time and care into the hiring process. Your resume will be reviewed by a human, so we encourage you to keep your resume short (one page should do), double-check for grammar errors, and submit it as a PDF.</p>\n<p>During the interview process, you can expect conversational-style sessions, a skills assessment, and a live meeting simulation.</p>\n<p><b>Our Commitment to Diversity, Equity, &amp; Inclusion:</b></p>\n<p>We believe that there is no single candidate profile that guarantees success in this role. Experience comes in different forms; many skills are transferable, and passion goes a long way. If your background is similar to the job description and you think you can excel in this role, please apply and tell us about yourself and the impact you could make at Elevate Labs.</p>",
    "pubDate": "2024-09-12 07:51:04",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda5f1"
    },
    "id": 108434,
    "url": "https://jobicy.com/jobs/108434-senior-account-executive-6",
    "jobSlug": "108434-senior-account-executive-6",
    "jobTitle": "Senior Account Executive",
    "companyName": "Osano",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/12/09e360f6195b249a269ef96fe9a99259.png",
    "jobIndustry": ["Sales"],
    "jobType": ["full-time"],
    "jobGeo": "USA",
    "jobLevel": "Senior",
    "jobExcerpt": "Osano is hiring an experienced Sr. Account Executive to join our growing team! The ideal candidate is competitive by nature, enjoys lead generation, connecting prospects to insights + products to solve their business challenges, and has experience selling a SaaS, B2B solution, preferably in the data privacy, security, or compliance industries.  This role serves as&#8230;",
    "jobDescription": "<p><span data-contrast=\"none\">Osano is hiring an experienced Sr. Account Executive to join our growing team! The ideal candidate is competitive by nature, enjoys lead generation, connecting prospects to insights + products to solve their business challenges, and has experience selling a SaaS, B2B solution, preferably in the data privacy, security, or compliance industries.</span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335557856&quot;:16777215,&quot;335559739&quot;:160,&quot;335559740&quot;:276}\"> </span></p>\n<p><span data-contrast=\"none\">This role serves as a key champion in the customer lifecycle, so we’re looking for someone who will enthusiastically represent our people, product, and ideals. You’ll receive warm leads via our SDR and marketing teams, as well as create your own leads in marketing, compliance, data security, and legal target companies of all sizes. You’ll leverage your research, intuition, creativity, and personality to form authentic relationships. You’ll also be in direct control of your success as the compensation for this role is a combination of base + uncapped commission. </span></p>\n<h2><strong><span data-contrast=\"none\">The Role</span></strong></h2>\n<ul>\n<li data-leveltext=\"●\" data-font=\"Roboto\" data-listid=\"89\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Roboto&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;●&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">Sell Osano’s proprietary consent management, data mapping, data discovery, vendor monitoring, and privacy program applications to organizations seeking to satisfy regulatory requirements such as GDPR and CCPA and build a trusted brand based on transparent data privacy management</span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:276}\"> </span></li>\n<li data-leveltext=\"●\" data-font=\"Roboto\" data-listid=\"89\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Roboto&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;●&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">Uncover goals, challenges, and requirements of prospects and customers, including budget constraints and decision-makers</span></li>\n<li data-leveltext=\"●\" data-font=\"Roboto\" data-listid=\"89\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Roboto&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;●&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">Deliver compelling presentations, demos, and proposals</span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:276}\"> </span></li>\n<li data-leveltext=\"●\" data-font=\"Roboto\" data-listid=\"89\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Roboto&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;●&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">Negotiate pricing and contractual agreements</span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:276}\"> </span></li>\n<li data-leveltext=\"●\" data-font=\"Roboto\" data-listid=\"89\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Roboto&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;●&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">Meet/Exceed individual targets and contribute to the overall team success</span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:276}\"> </span></li>\n<li data-leveltext=\"●\" data-font=\"Roboto\" data-listid=\"89\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Roboto&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;●&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">Provide account analysis and revenue forecast</span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:276}\"> </span></li>\n<li data-leveltext=\"●\" data-font=\"Roboto\" data-listid=\"89\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Roboto&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;●&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">Manage a robust pipeline, including running with high intent leads and hunting in defined territories with the support of a world-class sales development and marketing team</span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:276}\"> </span></li>\n<li data-leveltext=\"●\" data-font=\"Roboto\" data-listid=\"89\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Roboto&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;●&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">Nurture our supportive culture by building relationships across the company and working closely with others to ensure clients’ success/satisfaction</span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:276}\"> </span></li>\n<li data-leveltext=\"●\" data-font=\"Roboto\" data-listid=\"89\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Roboto&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;●&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">Stay up-to-date with privacy trends + our technical products, services, pricing model, and value proposition</span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:276}\"> </span></li>\n<li data-leveltext=\"●\" data-font=\"Roboto\" data-listid=\"89\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Roboto&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;●&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">Travel may be required for large deals or market opportunities (do what you need to do to close the deal; travel is expected to be &lt;15% of this role)</span></li>\n</ul>\n<h2><strong><span data-contrast=\"none\">About You</span></strong></h2>\n<ul>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"110\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">You bring years of quota-carrying software sales experience</span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335557856&quot;:16777215,&quot;335559739&quot;:160,&quot;335559740&quot;:276}\"> </span></li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"110\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">You have experience in governance/risk/compliance technology, legaltech, cybersecurity, or similar technical sales environments</span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335557856&quot;:16777215,&quot;335559739&quot;:160,&quot;335559740&quot;:276}\"> </span></li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"110\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">You have experience providing technical demos to prospects and know when to bring in a Sales or Solutions Engineer for when more technical resources are needed  </span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335557856&quot;:16777215,&quot;335559739&quot;:160,&quot;335559740&quot;:276}\"> </span></li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"110\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">You have experience managing/closing early-stage product sales cycles and a track record of over-achieving quota in past positions</span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335557856&quot;:16777215,&quot;335559739&quot;:160,&quot;335559740&quot;:276}\"> </span></li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"110\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">You want to be part of a world-class revenue organization committed to investing in your development</span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335557856&quot;:16777215,&quot;335559739&quot;:160,&quot;335559740&quot;:276}\"> </span></li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"110\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">You have working knowledge of HubSpot (or comparable CRM), Gmail, LinkedIn, and other sales tools or willingness to learn</span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335557856&quot;:16777215,&quot;335559739&quot;:160,&quot;335559740&quot;:276}\"> </span></li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"110\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">You have a hunger to constantly improve by seeking out feedback and being self-aware</span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335557856&quot;:16777215,&quot;335559739&quot;:160,&quot;335559740&quot;:276}\"> </span></li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"110\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">You take pride in your communication and see it as a representation of your brand; you understand that clear, concise communication builds rapport and trust</span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335557856&quot;:16777215,&quot;335559739&quot;:160,&quot;335559740&quot;:276}\"> </span></li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"110\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">You are highly resourceful and able to overcome obstacles with positivity, creativity, and grit</span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335557856&quot;:16777215,&quot;335559739&quot;:160,&quot;335559740&quot;:276}\"> </span></li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"110\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">You are constantly curious and don’t just leverage resources but learn from them</span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335557856&quot;:16777215,&quot;335559739&quot;:160,&quot;335559740&quot;:276}\"> </span></li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"110\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">You are a builder &#8211; you are motivated by contributing to processes, messaging, and market insights</span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335557856&quot;:16777215,&quot;335559739&quot;:160,&quot;335559740&quot;:276}\"> </span></li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"110\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">Lastly, you should thrive in a remote environment &#8211; for us, that means being empathetic, proactively communicating, and bringing ingenuity and initiative every day</span><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335557856&quot;:16777215,&quot;335559739&quot;:160,&quot;335559740&quot;:276}\"> </span></li>\n</ul>\n<h2><strong><span data-contrast=\"none\">Why Us</span></strong></h2>\n<ul>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"15\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">We’re a welcoming team that&#8217;s dependable, curious, moves fast, and full of talented people</span></li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"15\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">We’re a B-corporation with a mission that matters, and we’re in a high-growth space with even more potential</span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335557856&quot;:16777215,&quot;335559685&quot;:720,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:276,&quot;335559991&quot;:360}\"> </span></li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"15\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">You’ll become a privacy expert, including the opportunity to obtain your Certified Information Privacy Technologist credential</span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335557856&quot;:16777215,&quot;335559685&quot;:720,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:276,&quot;335559991&quot;:360}\"> </span></li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"15\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"1\" data-aria-level=\"1\"><span data-contrast=\"none\">You&#8217;ll have access to our training program, well-defined career paths, and a leadership team that values professional development</span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335557856&quot;:16777215,&quot;335559685&quot;:720,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:276,&quot;335559991&quot;:360}\"> </span></li>\n</ul>\n<h2><strong><span data-contrast=\"none\">Benefits</span></strong></h2>\n<ul>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"15\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"5\" data-aria-level=\"1\"><span data-contrast=\"none\">Fair-pay compensation (provided below) and ownership interest/equity </span></li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"15\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"6\" data-aria-level=\"1\"><span data-contrast=\"none\">Unlimited paid time off + a requirement to take at least two weeks off per year </span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335557856&quot;:16777215,&quot;335559685&quot;:720,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:276,&quot;335559991&quot;:360}\"> </span></li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"15\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"6\" data-aria-level=\"1\"><span data-contrast=\"none\">We&#8217;re a Best Place for Working Parents and offer paid parental leave for all new parents + we believe that family (however you define it) always comes first  </span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335557856&quot;:16777215,&quot;335559685&quot;:720,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:276,&quot;335559991&quot;:360}\"> </span></li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"15\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"6\" data-aria-level=\"1\"><span data-contrast=\"none\">Osano sponsors individual premiums at 100% and dependent premiums at 50% for Medical, Dental, and Vision insurance via Aetna  </span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335557856&quot;:16777215,&quot;335559685&quot;:720,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:276,&quot;335559991&quot;:360}\"> </span></li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"15\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"6\" data-aria-level=\"1\"><span data-contrast=\"none\">A fully + permanently remote company so you can work from anywhere in the U.S. </span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335557856&quot;:16777215,&quot;335559685&quot;:720,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:276,&quot;335559991&quot;:360}\"> </span></li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"15\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"6\" data-aria-level=\"1\"><span data-contrast=\"none\">Receive a Macbook + $1,000 to craft your home workspace  </span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335557856&quot;:16777215,&quot;335559685&quot;:720,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:276,&quot;335559991&quot;:360}\"> </span></li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"15\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"6\" data-aria-level=\"1\"><span data-contrast=\"none\">Annual company trip designed to foster connection, creativity, and having fun </span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335557856&quot;:16777215,&quot;335559685&quot;:720,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:276,&quot;335559991&quot;:360}\"> </span></li>\n<li data-leveltext=\"\" data-font=\"Symbol\" data-listid=\"15\" data-list-defn-props=\"{&quot;335552541&quot;:1,&quot;335559685&quot;:720,&quot;335559991&quot;:360,&quot;469769226&quot;:&quot;Symbol&quot;,&quot;469769242&quot;:[8226],&quot;469777803&quot;:&quot;left&quot;,&quot;469777804&quot;:&quot;&quot;,&quot;469777815&quot;:&quot;hybridMultilevel&quot;}\" data-aria-posinset=\"6\" data-aria-level=\"1\"><span data-contrast=\"none\">Mental health benefits with free memberships to mindfulness + talk therapy services</span><span data-ccp-props=\"{&quot;134233117&quot;:false,&quot;134233118&quot;:false,&quot;201341983&quot;:0,&quot;335551550&quot;:1,&quot;335551620&quot;:1,&quot;335557856&quot;:16777215,&quot;335559685&quot;:720,&quot;335559737&quot;:0,&quot;335559738&quot;:0,&quot;335559739&quot;:160,&quot;335559740&quot;:276,&quot;335559991&quot;:360}\"> </span></li>\n</ul>\n<h2><strong><span data-contrast=\"none\">Compensation</span></strong></h2>\n<p><span data-contrast=\"none\">Based on your skills and experience, and quota capacity, you can expect your annual on-target earnings to be $175,000. Osano has a strong culture of quota attainment with generous accelerators. We want everyone at Osano to have a stake in our success, so you&#8217;ll also receive stock options upon joining the company. </span></p>\n<div class=\"content-conclusion\">\n<h2><strong>A bit more about Osano</strong></h2>\n<p>​​Osano is an Austin area, venture-backed startup focused on creating transparency in data. Osano is a B-corp (public benefit corp), which means that, although we are a for-profit company, we are mission-oriented, and we wake up every morning with the goal of doing well by doing good. We&#8217;re an easy solution to data privacy laws! Osano is a data privacy platform that instantly helps websites become compliant with laws such as GDPR and CCPA. Osano works to keep companies out of trouble and monitors all of the vendors they share data with – so they don&#8217;t have to.</p>\n<p>At Osano, we value candidates from all walks of life and are focused on building a diverse team. If you don&#8217;t exactly meet all of the job requirements, don&#8217;t let that keep you from applying. We&#8217;re looking for people who are eager to learn and grow with us. If you&#8217;re interested in being part of our inclusive, mission-driven, venture-backed tech startup, say hi!</p>\n<p><span class=\"EOP SCXW188574026 BCX8\" data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\"><span data-ccp-props=\"{&quot;201341983&quot;:0,&quot;335559740&quot;:276}\"><span class=\"ui-provider a b c d e f g h i j k l m n o p q r s t u v w x y z ab ac ae af ag ah ai aj ak\">We&#8217;re a fully-remote startup with employees who work from the continental United States. However, at our current stage, we are unable to provide sponsorship for employment visas or employ individuals outside of the US. </span></span></span></p>\n<p><em>Osano is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, gender, gender expression, gender identity, sexual orientation, national origin, disability status, protected veteran status, neurodiversity, parental status, or any other characteristic protected by law. We value what makes us different and want to see how you can make our team better! </em></p>\n</div>",
    "pubDate": "2024-09-12 07:48:22",
    "annualSalaryMin": "175000",
    "annualSalaryMax": "",
    "salaryCurrency": "USD",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda5f2"
    },
    "id": 105069,
    "url": "https://jobicy.com/jobs/105069-paid-search-manager",
    "jobSlug": "105069-paid-search-manager",
    "jobTitle": "Associate Paid Search Manager",
    "companyName": "Wpromote",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/08/e1003ec6a2d34525775d0bc7912ced79.jpg",
    "jobIndustry": ["Marketing &amp; Sales"],
    "jobType": ["full-time"],
    "jobGeo": "USA",
    "jobLevel": "Any",
    "jobExcerpt": "We’re looking for a Paid Search Associate Manager to join the rapidly expanding team that is the backbone of our company. You’ll directly manage search engine marketing (SEM) campaigns across both Google Ads and Microsoft Ads and paid social ads, making optimizations and updates daily. You’ll be supporting Managers and Senior Managers on the team&#8230;",
    "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>We’re looking for a Paid Search Associate Manager to join the rapidly expanding team that is the backbone of our company. You’ll directly manage search engine marketing (SEM) campaigns across both Google Ads and Microsoft Ads and paid social ads, making optimizations and updates daily. You’ll be supporting Managers and Senior Managers on the team but also with managers from other channels, and learn how to craft campaign strategies for your book of clients.</div>\n<div></div>\n<div>At Wpromote, we believe that great work is only possible with great people. Our goal is to build a better, more inclusive work environment and support our people at every stage of their careers by prioritizing a strong work-life balance through our policies and benefits listed below. As a Best Place to Work according to both Ad Age and Glassdoor and Adweek’s Fastest Growing Digital Agency, we are moving fast to expand our teams and bring new experts into the fold to keep pushing the boundaries of what’s possible in marketing.</div>\n<div></div>\n<div>The anticipated annual salary for this role will range from $58,000 &#8211; $69,000, based on consideration of a wide array of factors unique to each candidate, including but not limited to skill set, years and depth of experience, education and certifications, competitive benchmarks, scope of responsibility, market dynamics, geographic location, and respective state’s salary threshold for exempt employees. At Wpromote, pay ranges are subject to change and are based on specific market medians for similar jobs according to third-party salary benchmark surveys. Individual pay within that range can vary due to skills, experience, and available budget. The total compensation package for this role will include benefits (listed above).</div>\n<div></div>\n<div>*This position may be performed remotely in most states within the US, with some exclusions</div>\n<div>**While this position is remote-friendly, preference will be given to candidates based in Los Angeles, Chicago, and NYC</div>\n<div>***This position is not eligible for immigration sponsorship</div>\n<div></div>\n<div><strong><i>Important Notice: Beware of Job Scams</i></strong></div>\n<div>Wpromote recruiting communications will only be sent through our official channels via wpromote.com email addresses. If you see a posting elsewhere that is not reflected on Wpromote.com/careers, it may be a fraudulent posting. We do not require payment or fees during the hiring process nor do we request sensitive information, such as Social Security numbers or payment details. Please safeguard yourself against possible scams and contact us if you encounter any suspicious activity.</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>You Will Be</h2>\n<ul>\n<li>Put through a comprehensive training program to learn the ins and outs of paid search and how it impacts a client’s overall business</li>\n<li>Responsible for managing your own book of business with team support for both paid search and paid social</li>\n<li>Supporting and assisting the wider team with growth and enterprise level strategies</li>\n<li>Researching performance numbers in order to find ways to improve the efficiency of campaigns on the enterprise level accounts that you’ll be supporting</li>\n<li>Conducting keyword research, writing ad copy, and implementing bid optimizations</li>\n<li>Building performance reports to share with clients</li>\n<li>Proactively doing competitive research in order to isolate new opportunities</li>\n<li>Applying best practices and providing new recommendations to clients</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>You Must Have</h2>\n<ul>\n<li>Preferred 1-2 years of experience working in paid media advertising comprised of media buying and planning within an agency/client environment</li>\n<li>Bachelor’s degree in communications, advertising, marketing, or related discipline</li>\n<li>Understanding of search engines such as Google, Microsoft, etc</li>\n<li>Familiarity with keyword research tools and web analytics tools (Google Analytics)</li>\n<li>The ability to work under tight deadlines, think on your feet, work with limited resources, and manage multiple campaigns.</li>\n<li>General knowledge of search engine optimization (SEO), social advertising, and web usability</li>\n<li>Strong Microsoft Excel skills: pivot tables, VLOOKUPS and chart building</li>\n<li>The ability to quickly pick up new skills and learn new tasks while demonstrating strong attention to detail</li>\n<li>Excellent oral, written, and interpersonal skills, with the ability to identify and respond to situations with the sense of urgency</li>\n<li>Experience with Google Suite and MS Office</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\" data-qa=\"closing-description\">\n<div>Wpromote is committed to bringing together individuals from different backgrounds and perspectives, providing employees with a safe and welcoming environment free of discrimination and harassment. We strive to create a diverse &amp; inclusive environment where everyone can thrive, feel a sense of belonging, and do impactful work together. As an equal opportunity employer, we prohibit any unlawful discrimination against a job applicant on the basis of their race, color, religion, gender, gender identity, gender expression, sexual orientation, national origin, family or parental status, disability*, age, veteran status, or any other status protected by the laws or regulations in the locations where we operate. We respect the laws enforced by the EEOC and are dedicated to going above and beyond in fostering diversity across our workplace.</div>\n<div></div>\n<div>Applicants with disabilities may be entitled to reasonable accommodation under the terms of the Americans with Disabilities Act and certain state or local laws. A reasonable accommodation is a change in the way things are normally done which will ensure an equal employment opportunity without imposing undue hardship on Wpromote.</div>\n</div>\n</div>",
    "pubDate": "2024-09-12 07:47:39",
    "annualSalaryMin": "58000",
    "annualSalaryMax": "69000",
    "salaryCurrency": "USD",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda5f3"
    },
    "id": 95651,
    "url": "https://jobicy.com/jobs/95651-senior-product-designer-41",
    "jobSlug": "95651-senior-product-designer-41",
    "jobTitle": "Staff Product Designer",
    "companyName": "Gusto",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/Gusto.jpg",
    "jobIndustry": ["Web &amp; App Design"],
    "jobType": ["full-time"],
    "jobGeo": "Canada,  USA",
    "jobLevel": "Senior",
    "jobExcerpt": "Gusto is a modern, online people platform that helps small businesses take care of their teams. On top of full-service payroll, Gusto offers health insurance, 401(k)s, expert HR, and team management tools. Today, Gusto offices in Denver, San Francisco, and New York serve more than 300,000 businesses nationwide. Our mission is to create a world&#8230;",
    "jobDescription": "<div class=\"content-intro\">\n<div class=\"content-intro\">\n<div class=\"content-intro\">\n<p>Gusto is a modern, online people platform that helps small businesses take care of their teams. On top of full-service payroll, Gusto offers health insurance, 401(k)s, expert HR, and team management tools. Today, Gusto offices in Denver, San Francisco, and New York serve more than 300,000 businesses nationwide.</p>\n<p>Our mission is to create a world where work empowers a better life, and it starts right here at Gusto. That’s why we’re committed to building a collaborative and inclusive workplace, both physically and virtually.</p>\n</div>\n<p>Product Design at Gusto is made up of over 60 creative, collaborative people who care deeply about our mission to empower small businesses and their employees. We’re a cross-functional bunch focused on Design, Research, Writing, Ops and Front-end Development who are always looking for opportunities to build understanding and empathy for the people who use Gusto. We don’t care a whole lot about swim lanes and we work closely with our partners in Product, Engineering, Data, and Marketing to design, build and ship experiences that make a difference. We are passionate advocates for thoughtful, crafted, and inclusive experiences and we believe great design can make hard things possible, even delightful.</p>\n<h2><strong>About the Opportunity</strong></h2>\n<p>We have a number of Staff Designer roles within various teams at Gusto!</p>\n<h2><strong>Here’s what you’ll do day-to-day</strong></h2>\n<ul>\n<li>Work with cross-functional partners in Product Management, Engineering, and Data Science to understand customer problems, key opportunities in your domain, and define both the long term UX vision and also short term releases that unlock customer value</li>\n<li>Collaborate with our Research, Data Science, and Customer Support teams to build a holistic understanding of customer needs, and make sure they’re shared with your teams to inform their thinking, build empathy, and inform prioritization decisions</li>\n<li>Advocate for great UX, inspiring your teams with a strong point of view about what’s possible and aspirational for your product area</li>\n<li>Hold high standards for the customer experience, including partnering with engineering partners to refine the end customer experience and ensure that what we release is bug free, performant, accessible, and responsive</li>\n<li>Design for how your experience fits into our system and advocate for cohesive experiences through the use of Workbench, our Design System, and other platform capabilities</li>\n<li>Speak clearly to tradeoffs and the “Why” behind design decisions in terms non-designers can understand and participate in</li>\n<li>Provide and seek feedback from other designers to always push the bar for quality</li>\n<li>Collaborate with designers on other teams to develop cohesive solutions for shared problems</li>\n<li>You’ll drive team-wide impact through mentorship, fostering a culture of growth and collaboration</li>\n</ul>\n<h2><strong>Here’s what we&#8217;re looking for</strong></h2>\n<ul>\n<li>8+ years&#8217; Product Design experience\n<ul>\n<li>Bonus for Gusto if you’ve worked in domains connected to HR like Payroll, Benefits, Finance, and/or Workforce Management.</li>\n</ul>\n</li>\n<li>A builder who loves being hands on crafting high quality, high impact solutions and getting them in front of customers\n<ul>\n<li>Experience designing and shipping products in complex domains informed by research, data, and insights from support teams demonstrated through a portfolio of work you’ve directly contributed to</li>\n<li>Systems thinking, including using and contributing to a Design System and designing with a Platform-first approach</li>\n<li>Ability to explain the impact of your work, tradeoffs you’ve made, lessons learned, and design rationale</li>\n<li>The ability to think long term towards a broader vision or step change, while being able to speak to scoping and sequencing to deliver iterative value</li>\n<li>Experience balancing long-term design goals with an Agile-based iterative approach</li>\n<li>Strong communication skills and enthusiasm for collaborating across the entire company</li>\n</ul>\n</li>\n<li>Experience designing end-to-end customer journeys from software to service</li>\n<li>Strong understanding of common web patterns, foundations, and the ability to discern when to innovate versus adopt existing standards</li>\n<li>Strong opinions loosely held and a willingness to engage in constructive debates about scope and tradeoffs to build alignment and unblock work</li>\n<li>Strong UX craft — you can break down complex experiences and design with consideration for all touchpoints</li>\n<li>Ability to embrace ambiguous situations as opportunities to create</li>\n<li>Passion for Gusto’s mission and the impact we can have on the world</li>\n</ul>\n<p>At Gusto, we strive to provide rewards that empower employees to achieve their financial and personal goals. We offer competitive compensation packages with a strong emphasis on equity based compensation (ownership in Gusto). To learn more about Gusto’s compensation philosophy and benefits offerings please view our Total Rewards Approach page.</p>\n<p>Our cash compensation range for this role is $133,000/yr to $182,000/yr in Denver &amp; most remote locations, and $161,000/yr to $219,000/yr in San Francisco &amp; New York. Final offer amounts are determined by multiple factors, including candidate experience and expertise, and may vary from the amounts listed above.</p>\n<div class=\"content-conclusion\">\n<p>Gusto has physical office spaces in Denver, San Francisco, and New York City. Employees who are based in those locations will be expected to work from the office on designated days approximately <strong>2-3 days </strong>per week (or more depending on role). The same office expectations apply to all Symmetry roles, Gusto&#8217;s subsidiary, whose physical office is in Scottsdale.</p>\n<p>Note: The San Francisco office expectations encompass both the San Francisco and San Jose metro areas.</p>\n<p>When approved to work from a location other than a Gusto office, a secure, reliable, and consistent internet connection is required.</p>\n</div>\n</div>\n</div>",
    "pubDate": "2024-09-12 07:46:40",
    "annualSalaryMin": "133000",
    "annualSalaryMax": "182000",
    "salaryCurrency": "USD",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda5f4"
    },
    "id": 110648,
    "url": "https://jobicy.com/jobs/110648-print-engineer-print-output-manager",
    "jobSlug": "110648-print-engineer-print-output-manager",
    "jobTitle": "Print Engineer (Print Output Manager)",
    "companyName": "Assurant",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/11/631e270cd95fcdb3eaa2c8938c98d062.png",
    "jobIndustry": ["Product &amp; Operations"],
    "jobType": ["full-time"],
    "jobGeo": "USA",
    "jobLevel": "Any",
    "jobExcerpt": "The Print Output Engineer is responsible for creating and maintaining map rules for customer correspondence, development and execution of print jobs, support, planning, implementation and monitoring of systems across various platforms. This includes the understanding of standard engineering patterns in one domain. This role will use VDE Scripting which is similar to C / C++&#8230;",
    "jobDescription": "<p>The Print Output Engineer is responsible for creating and maintaining map rules for customer correspondence, development and execution of print jobs, support, planning, implementation and monitoring of systems across various platforms. This includes the understanding of standard engineering patterns in one domain. This role will use VDE Scripting which is similar to C / C++ or other scripting languages to execute print jobs for Assurant’s business units.</p>\n<h2><b>Why would I want this position? </b></h2>\n<ul>\n<li>100% virtual.</li>\n<li>Great team environment.</li>\n<li>Would be joining a team with some of the highest scores in the company.</li>\n<li>Work on projects where results are visual and impactful.</li>\n<li>Work with the BlueCrest tool set.</li>\n</ul>\n<h2><b>What will be my duties and responsibilities in this job?</b></h2>\n<ul>\n<li>Supporting all lines of business that are producing customer print that is sent to out print vendor or the service centers for printing and mailing.</li>\n<li>Monitoring daily print cycles to ensure proper execution.</li>\n<li>Creating new scripting for new clients.</li>\n<li>Modifying existing scripts when required changes are requested by the line of business or client.</li>\n<li>Trouble shooting any issues that may arise and assist line of business with a permanent resolution.</li>\n<li>On-call 24/7 support is required on a rotating basis</li>\n</ul>\n<h2><b>What are the requirements needed for this position? </b></h2>\n<ul>\n<li>2+ years of experience working with BlueCrest print software, Pitney Bowes, Emtex, Crawford Conductor, Crawford Designer, or other enterprise printing software. 5+ years of experience with BlueCrest is preferred.</li>\n<li>2+ years working with Output Manager, Enterprise Manager, VDE Scripting or similar.</li>\n<li>1+ years of software programming using C, C++, Python, PHP, JavaScript or similar programming languages.</li>\n<li>Strong communication acumen both orally and written, service oriented, ability to build strong working relationships, executes work requirements with some guidance.</li>\n<li>High School Diploma or GED. Undergraduate degree in MIS and Computer Science preferred.</li>\n</ul>\n<p>Pay Range: $84,100.00 &#8211; $140,500.00</p>\n<p>Any posted pay range considers a wide range of compensation factors, including candidate background, experience and work location, while also allowing for salary growth within the position.</p>",
    "pubDate": "2024-09-12 07:45:58",
    "annualSalaryMin": "84100",
    "annualSalaryMax": "140500",
    "salaryCurrency": "USD",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda5f5"
    },
    "id": 110647,
    "url": "https://jobicy.com/jobs/110647-account-executive-2",
    "jobSlug": "110647-account-executive-2",
    "jobTitle": "Account Executive",
    "companyName": "Assurant",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/11/631e270cd95fcdb3eaa2c8938c98d062.png",
    "jobIndustry": ["Sales"],
    "jobType": ["full-time"],
    "jobGeo": "USA",
    "jobLevel": "Any",
    "jobExcerpt": "As the Account Executive for the Renters Solutions team, you will manage multiple assigned client relationships and implementations. You will accomplish this by building and maintaining positive relationships and motivating and fostering a cohesive, creative, and positive work environment with clients, counterparts, internal support teams, and management to achieve optimal work performance and communication. You&#8230;",
    "jobDescription": "<p>As the Account Executive for the Renters Solutions team, you will manage multiple assigned client relationships and implementations. You will accomplish this by building and maintaining positive relationships and motivating and fostering a cohesive, creative, and positive work environment with clients, counterparts, internal support teams, and management to achieve optimal work performance and communication. You will assist clients with identifying areas of opportunity for improvement, processes, and procedures. This will include formulating action plans to coordinate the resources and requirements necessary to manage implementations, client performance, and escalations to completion. You will manage the integrity of client data by ensuring the quality of business arrangement data from proposal through implementation.</p>\n<h2><b>What will be my duties and responsibilities in this job?</b></h2>\n<ul>\n<li>Manage day-to-day relationships and onboarding with assigned and new clients.</li>\n<li>Develop and maintain positive relationships with key contacts within client organizations at various levels.</li>\n<li>Supporting the introduction and implementation of opportunities that advance strategic solutions within the client.</li>\n<li>Develop recommendations based on program performance through financial analysis, report any challenges, and provide solutions and alternative recommendations to the client and leadership.</li>\n<li>Partner with the Operations team and other internal stakeholders to oversee the execution and implementation of new client installs and strategic priorities.</li>\n<li>Identify, present, and (when the agreement is obtained) manage the implementation of new business opportunities and program enhancements for revenue growth and retention.</li>\n<li>Monitor overall Operational service level agreements (SLAs) and work with operation teams to maintain contractual SLA performance.</li>\n<li>Prepare and conduct business reviews by coordinating, creating, and verifying all documentation and all other participation and logistical arrangements.</li>\n<li>Advocate and manage change requirements for clients as specified by Assurant and the various supporting functional teams to comply with all business guidelines, state compliance, and governed statutes.</li>\n<li>Collaborating with Sales, Legal, Product Management, and Executive Leadership in the contracting and renewing of contracts with the assigned clients.  This includes interacting with various levels (CFO, Chief Compliance Officer, Chief General Counsel, Actuarial, and Sales Leaders) internally and within the client.</li>\n</ul>\n<h2><b>What are the requirements needed for this position? </b></h2>\n<ul>\n<li>A minimum of 3 years of experience in client Account Management and Development.</li>\n<li>Experienced in supporting competing priorities and creating solutions to client escalations.</li>\n<li>Bachelor’s degree or equivalent work experience.</li>\n</ul>\n<h2><b>What other skills/experience would be helpful to have?</b></h2>\n<ul>\n<li>P&amp;C Insurance experience is highly preferred.</li>\n<li>Experienced working effectively with a wide variety of company functions and individuals.</li>\n<li>Perform work responsibilities promptly and in a fast-paced, high-volume work environment.</li>\n<li>Led and managed the coordination of large groups to drive results.</li>\n<li>Maintain confidentiality when required to ensure access to and use of specific company and employee information is limited as required by Assurant management.</li>\n</ul>\n<h2><b>How much should I expect to travel?</b></h2>\n<ul>\n<li>You will be expected to travel up to 10%</li>\n</ul>\n<p>Pay Range: $71,300.00 &#8211; $119,100.00</p>\n<p>Any posted pay range considers a wide range of compensation factors, including candidate background, experience and work location, while also allowing for salary growth within the position.</p>",
    "pubDate": "2024-09-12 07:44:31",
    "annualSalaryMin": "71300",
    "annualSalaryMax": "119100",
    "salaryCurrency": "USD",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda5f6"
    },
    "id": 110645,
    "url": "https://jobicy.com/jobs/110645-data-engineer-ii",
    "jobSlug": "110645-data-engineer-ii",
    "jobTitle": "Data Engineer II",
    "companyName": "Astreya",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/02/964f66282c98416d985eee76dc8b208e.jpeg",
    "jobIndustry": ["Software Engineering"],
    "jobType": ["full-time"],
    "jobGeo": "Poland",
    "jobLevel": "Any",
    "jobExcerpt": "We are looking for a Data Engineer to join our growing team of analytics experts. The hire will be responsible for expanding and optimizing our data and data pipeline architecture, as well as optimizing data flow and collection for cross functional teams. The Data Engineer will support our data analysts on data initiatives and will&#8230;",
    "jobDescription": "<p>We are looking for a Data Engineer to join our growing team of analytics experts. The hire will be responsible for expanding and optimizing our data and data pipeline architecture, as well as optimizing data flow and collection for cross functional teams. The Data Engineer will support our data analysts on data initiatives and will ensure optimal data delivery architecture is consistent throughout ongoing projects.</p>\n<h2><b>Scope:</b></h2>\n<ul>\n<li>Applies company policies and procedures to resolve a variety of issues</li>\n<li>Works on problems of moderate scope</li>\n<li>Receives general instructions on routine work and detailed instructions on new projects</li>\n</ul>\n<h2><b>Your Roles and Responsibilities:</b></h2>\n<ul>\n<li>Create and maintain optimal data pipeline architecture</li>\n<li>Assemble large, complex data sets that meet functional / non-functional business requirements</li>\n<li>Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources</li>\n<li>Build analytics tools that utilize the data pipeline to provide actionable insights into customer acquisition, operational efficiency and other key business performance metrics.</li>\n<li>Work with stakeholders including the Executive, Product, Data and Design teams to assist with data-related technical issues and support their data infrastructure needs.</li>\n<li>Create data tools for team members to assist them in building and optimizing analytics production</li>\n<li>Work with data and analytics experts to strive for greater functionality in our data systems.</li>\n<li>Other duties as required. This list is not meant to be a comprehensive inventory of all responsibilities assigned to this position</li>\n</ul>\n<h2><b>Required Qualifications/Skills:</b></h2>\n<ul>\n<li>Bachelor’s degree (B.S/B.A) from four-college or university and 2 to 5 years’ related experience and/or training; or equivalent combination of education and experience</li>\n<li>Builds productive internal and external working relationships</li>\n<li>Exercises judgment within defined procedures and practices to determine appropriate action</li>\n<li>Proficiency in languages SAS, Python, Java, and MatLab</li>\n<li>ETL (Extract, Transform, and Load)</li>\n<li>Database &#8211; SQL and NoSQL</li>\n<li>Data Warehousing – Hadoop, MapReduce, HIVE, Presto</li>\n<li>Operating system: UNIX, Linux</li>\n<li>Follows standard practice and procedures when analyzing situations or data</li>\n</ul>\n<h2><b>Preferred Qualifications: </b></h2>\n<ul>\n<li>Programming language: Javascript, R</li>\n<li>Basic Machine Learning</li>\n</ul>\n<h2><b>Physical Demand &amp; Work Environment:</b></h2>\n<ul>\n<li>Must have the ability to perform office-related tasks which may include prolonged sitting or standing</li>\n<li>Must have the ability to move from place to place within an office environment</li>\n<li>Must be able to use a computer</li>\n<li>Must have the ability to communicate effectively</li>\n<li>Some positions may require occasional repetitive motion or movements of the wrists, hands, and/or fingers</li>\n</ul>",
    "pubDate": "2024-09-12 07:40:53",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda5f7"
    },
    "id": 107483,
    "url": "https://jobicy.com/jobs/107483-full-stack-engineer-virtual-interlining",
    "jobSlug": "107483-full-stack-engineer-virtual-interlining",
    "jobTitle": "Full-Stack Engineer - Virtual Interlining",
    "companyName": "Hopper",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/WRILS-201020164254-931520.jpg",
    "jobIndustry": ["Software Engineering"],
    "jobType": ["full-time"],
    "jobGeo": "UK",
    "jobLevel": "Any",
    "jobExcerpt": "The Virtual Interlining team is responsible for producing new flight inventory by combining two or more tickets from different carriers.  This new inventory creates unique journeys which require a customer to take a self transfer but can save lots of money or time. The Portals team is responsible for delivery of this content in our&#8230;",
    "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>The Virtual Interlining team is responsible for producing new flight inventory by combining two or more tickets from different carriers.  This new inventory creates unique journeys which require a customer to take a self transfer but can save lots of money or time. The Portals team is responsible for delivery of this content in our White Label portal solutions and making sure that airlines and customers are getting the best possible content in a modern scalable interface.  Your team is the public face of the VI teams work and represents an unique opportunity to work on something that has direct customer impact.</div>\n<div></div>\n<div>You will be helping to design and expand our white label portal solutions, helping us to build a new platform to deploy changes to our customers and customizing our experience to meet the customer needs.</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>What would your day-to-day look like:</h2>\n<p>You will be a hands-on contributor helping to design, build and scale our backend distribution architecture.  You will help us deliver a platform for white label sites as well as extending the platform to bring new choices for features for our customers to use.  We will also try to update the system to be extendable, with a major goal of being able to deploy new sites in weeks versus months.</p>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>An ideal candidate has:</h2>\n<ul>\n<li>Have worked with customer facing products, with an excellent mindset on delivering quality updates to our product safely and repeatedly.</li>\n<li>Pragmatic Scala experience or strong development skills in Java.</li>\n<li>Experience in a FE Javascript based platform such as React or Typescript.</li>\n<li>Solid problem solving and debugging skills, with the tendency to want to automate around repetitive tasks to make things easier going forward.</li>\n<li>Experience with extending a core solution to multiple partners, reducing overhead for deployments and upkeep.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Perks of working with us:</h2>\n<ul>\n<li>Well-funded and proven startup with large ambitions, competitive salary, upsides of pre-IPO equity</li>\n<li>Monthly cash allowance to cover gym membership (100€) or telework (50€)</li>\n<li>Hopper covers the cost of employee premiums for private medical and dental coverage via Cigna.</li>\n<li>Coverage includes: primary medical assistance, dental care, nursing care, specialties, hospitalisation,</li>\n<li>maternity, preventative medicine and ambulatory services, and is available to extend to dependents.</li>\n<li>Hopper also offers private life and accident coverage via Surne.</li>\n<li>Unlimited PTO</li>\n<li>Puzl coworking All Access Pass OR Work-from-home stipend</li>\n<li>Entrepreneurial culture where pushing limits and taking risks is everyday business</li>\n<li>Open communication with management and company leadership</li>\n<li>Small, dynamic teams = massive impact</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\" data-qa=\"closing-description\">\n<h2><b>More about Hopper:</b></h2>\n<div>At Hopper, we are on a mission to become the leading travel platform globally – powering Hopper’s mobile app, website and our B2B business, HTS (Hopper Technology Solutions). By leveraging massive amounts of data and advanced machine learning algorithms, Hopper combines its world-class travel agency offering with proprietary fintech products to bring transparency, flexibility and savings to travelers globally. We have developed several unique fintech solutions that address everything from pricing volatility to trip disruptions – helping people travel better and save more on their trips.</div>\n<div></div>\n<div>The Hopper platform serves hundreds of millions of travelers globally and continues to capture market share around the world. Ranked the third largest online travel agency in North America, the Hopper app has been downloaded over 120 million times and has become largely popular among younger travelers – with 70% of its users being Gen Z and millennials.</div>\n<div></div>\n<div>While everyone knows us as the Gen Z and Millennial travel app, Hopper has evolved to become much more than that. In recent years, we’ve grown into a global travel agency and travel fintech provider that powers some of the world’s largest brands.</div>\n<div></div>\n<div>Through HTS, our B2B division, the company supercharges its partners’ direct channels by integrating our fintech products on their sites or powering end-to-end travel portals. Today, our partners include leading travel brands like Capital One, Nubank, Air Canada and many more.</div>\n</div>",
    "pubDate": "2024-09-11 08:37:01",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda5f8"
    },
    "id": 108432,
    "url": "https://jobicy.com/jobs/108432-java-developer-4",
    "jobSlug": "108432-java-developer-4",
    "jobTitle": "Senior Application Software Developer",
    "companyName": "Leidos",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/12/a037fdd7c89237d1e8378e4474d2bfa1.png",
    "jobIndustry": ["Programming"],
    "jobType": ["full-time"],
    "jobGeo": "USA",
    "jobLevel": "Senior",
    "jobExcerpt": "This position is for a Senior Java Software Developer on the ESA V program. ESA V is an IT applications and infrastructure services program supporting several customers within the Department of Justice (DOJ), including the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF). The program provides a range of IT services, including software application support, help desk,&#8230;",
    "jobDescription": "<p>This position is for a <b>Senior Java Software Developer</b> on the ESA V program. ESA V is an IT applications and infrastructure services program supporting several customers within the Department of Justice (DOJ), including the Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF). The program provides a range of IT services, including software application support, help desk, deskside support, Windows workstation engineering and maintenance, managed print services, ITSM, Active Directory services, and video conferencing.</p>\n<p>The program provides software development support for a variety of ATF custom software applications; these needs are growing as we support the customer’s move to the cloud and the associated application migration and modernization, and we are expanding our team. The individual selected for this position will work closely with the ATF to satisfy rapidly emerging Java development requirements and must be able to work as part of a team to design and implement solutions that meet customer requirements using an Agile methodology. This assignment mixes Front end GUI design and development skills (e.g., Angular.js, Node.js, Express.js, TypeScript, bootstrap, CSS, HTML etc.) with Java development skills to construct innovative solutions for the ATF.</p>\n<p>This position is 100% remote and requires working in a fast-paced, dynamic environment; this position also offers the ability for significant virtual support. Excellent communication skills are required to interact with the customer and program team. This position is contingent on receipt of required clearance from the Government customer.</p>\n<p>Required Clearance: Candidate selected will be subject to a Government Public Trust security investigation and must meet eligibility requirements for access to the customer’s information. US Citizenship is required. Current clearance is not required, but selected individual cannot start the assignment until the required security clearance is granted by the customer.</p>\n<h2><b>Primary Responsibilities</b></h2>\n<ul>\n<li>Develop and maintain Java software applications using Agile software development techniques.</li>\n<li>Support software application migration from an on-premise data center to a cloud environment.</li>\n<li>Consult with the business process owners, customers, users and constituents to develop and analyze customer requirements, enhance features, fix defects, and upgrade the application.</li>\n<li>Lead application testing, vulnerability fixes, regular application maintenance, license/certificate update, and solving complex issues.</li>\n<li>Create and maintain application documentation.</li>\n<li>Collaborate with members of project teams to ensure successful, technically sound projects which are completed on time and on budget.</li>\n</ul>\n<h2><b>Basic Qualifications</b></h2>\n<ul>\n<li>Bachelor’s degree from an accredited college in a related discipline, with 12 years of prior relevant experience; or a Master’s degree with 10 years of prior relevant experience; additional years of experience and/or relevant certifications will be considered in lieu of degree.</li>\n<li>Java Development JDK 1.7 / 1.8 (or higher); J2EE Technologies</li>\n<li>REST API, SOAP</li>\n<li>Relational SQL</li>\n<li>JBoss Middleware</li>\n<li>Apache Web Server</li>\n<li>HTML, CSS &amp; Webservices</li>\n<li>JavaScript frameworks Node / Angular / Express/ TypeScript</li>\n<li>RedHat Linux</li>\n<li>Cloud development experience</li>\n<li>AWS Technologies (API Gateway, S3, Lamba, etc.)</li>\n<li>Application Server Experience with Agile development</li>\n<li>Testing experience, including automated testing</li>\n<li>Excellent communication and teamwork skills, including team leadership experience</li>\n<li>Customer interface experience</li>\n<li>US Citizenship</li>\n</ul>\n<h2><b>Preferred Qualifications</b></h2>\n<ul>\n<li>Docker, Kubernetes, OpenShift</li>\n<li>GitLab, Jenkins, Nexus Repository, CloudFormation</li>\n<li>Integrated Development Environment</li>\n<li>noSQL</li>\n<li>Mobile application development experience</li>\n<li>Experience establishing goals and meeting project plan objectives</li>\n<li>Government contracting experience, particularly with the DOJ</li>\n<li>DOJ or DOD Clearance.</li>\n</ul>\n<h2><b>Pay Range:</b></h2>\n<p>Pay Range $122,200.00 &#8211; $220,900.00</p>\n<p>The Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law.</p>",
    "pubDate": "2024-09-11 08:36:24",
    "annualSalaryMin": "122200",
    "annualSalaryMax": "220900",
    "salaryCurrency": "USD",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda5f9"
    },
    "id": 108416,
    "url": "https://jobicy.com/jobs/108416-revenue-accounting-manager",
    "jobSlug": "108416-revenue-accounting-manager",
    "jobTitle": "Revenue Accounting Manager",
    "companyName": "Headway.co",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/12/068391a61855fb604bca051cafe3c510.jpeg",
    "jobIndustry": ["Finance &amp; Legal"],
    "jobType": ["full-time"],
    "jobGeo": "USA",
    "jobLevel": "Any",
    "jobExcerpt": "The Revenue Accounting Manager will own the company-wide revenue recognition under ASC 606, including supporting contract structuring, new product rollouts and revenue accounting processes and controls that scale with the growth of the company. You’ll report to the Controller who is looking for a trusted accounting expert to collaborate with the Engineering, Product and Data&#8230;",
    "jobDescription": "<p>The Revenue Accounting Manager will own the company-wide revenue recognition under ASC 606, including supporting contract structuring, new product rollouts and revenue accounting processes and controls that scale with the growth of the company. You’ll report to the Controller who is looking for a trusted accounting expert to collaborate with the Engineering, Product and Data teams to design and build in-house systems and tools that accurately report on revenue and accounts receivable.</p>\n<h2><strong>You will:</strong></h2>\n<ul>\n<li>Own revenue month-end close processes including preparing journal entries, account analysis and reconciliation to deliver timely and accurate financial results</li>\n<li>Oversee the design, implementation and execution of scalable and effective revenue processes for a more efficient close and strong control environment</li>\n<li>Work cross-functionally with Engineering, Product and Data as the primary Accounting expert in the team building in-house billing, cash reconciliation, accounts receivable collection and other accounting tools</li>\n<li>Identify product and system features needed to accurately report revenue and accounts receivable; coordinate with Engineering, Product and Data to determine requirements; test and review features and resolve any issues as necessary</li>\n<li>Analyze large data sets with SQL in tools such as metabase, palantir, etc. to validate underlying system configurations and financial reporting outputs</li>\n<li>Review customer contracts to ensure compliance with company policies and ASC 606</li>\n<li>Prepare monthly and quarterly revenue reporting and analytical materials</li>\n<li>Establish formal accounting policies in accordance with US GAAP, prepare technical revenue accounting memos and monitor relevant US GAAP developments to ensure revenue recognition policies are compliant</li>\n<li>Determine healthcare accounts receivable reserve and claims loss calculation methodologies suitable for the business</li>\n</ul>\n<h2><strong>You’d be a great fit for the role if:</strong></h2>\n<ul>\n<li>You have a Bachelor’s degree in Accounting or other relevant field</li>\n<li>You have a CPA with Big 4 or large accounting firm experience</li>\n<li>You have 6+ years of accounting experience (with at least 3+ years of revenue recognition experience)</li>\n<li>You have experience working with large datasets and SQL</li>\n<li>You have implemented an ERP, revenue recognition or billing system</li>\n<li>You have experience at a company with a complex payments system (e.g., marketplace, health care, fintech)</li>\n<li>You have the ability to lead and/or collaborate with cross-functional teams</li>\n<li>You have strong communication and interpersonal skills</li>\n</ul>\n<h2><strong>Compensation and Benefits:</strong></h2>\n<ul>\n<li>Salary information is based on a single salary target per role and is differentiated based on geographic location (Group A, B, or C)\n<ul>\n<li>Group A: $180,000</li>\n<li>Group B: $162,000</li>\n<li>Group C: $144,000</li>\n<li>Examples of cities located in each Compensation Grouping:\n<ul>\n<li>Group A = NYC, SF/Bay Area, LA Area, Seattle, Boston, Austin, and San Diego</li>\n<li>Group B = Chicago, Miami, Denver, Washington DC, Philadelphia, Atlanta, Minneapolis, Nashville, Sacramento, Phoenix, and Portland</li>\n<li>Group C = All remaining cities</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<ul>\n<li>Benefits offered include:\n<ul>\n<li>Equity Compensation</li>\n<li>Medical, Dental, and Vision coverage</li>\n<li>HSA / FSA</li>\n<li>401K</li>\n<li>Work-from-Home Stipend</li>\n<li>Therapy Reimbursement</li>\n<li>16-week parental leave for eligible employees</li>\n<li>Carrot Fertility annual reimbursement and membership</li>\n<li>13 paid holidays each year as well as a Holiday Break during the week between December 25th and December 31st</li>\n<li>Flexible PTO</li>\n<li>Employee Assistance Program (EAP)</li>\n<li>Training and professional development</li>\n</ul>\n</li>\n</ul>\n<div class=\"content-conclusion\">\n<p>We believe a team&#8217;s strength is in its people, and we cannot achieve this mission without a team that reflects the diversity of this problem &#8211; across race, ethnicity, gender, sexuality, age, national origin, religion, family status, disability, military status, and experience.</p>\n</div>",
    "pubDate": "2024-09-11 08:31:48",
    "annualSalaryMin": "144000",
    "annualSalaryMax": "180000",
    "salaryCurrency": "USD",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda5fa"
    },
    "id": 106243,
    "url": "https://jobicy.com/jobs/106243-senior-data-scientist-14",
    "jobSlug": "106243-senior-data-scientist-14",
    "jobTitle": "Senior Data Scientist",
    "companyName": "Headway.co",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/12/068391a61855fb604bca051cafe3c510.jpeg",
    "jobIndustry": ["Data Science"],
    "jobType": ["full-time"],
    "jobGeo": "USA",
    "jobLevel": "Senior",
    "jobExcerpt": "Headway’s mission is a big one &#8211; to build a new mental health care system everyone can access. We’ve built technology that helps people find great therapists with the first software-enabled national network of providers accepting insurance. 1 in 4 people in the US have a treatable mental health condition, but the majority of providers&#8230;",
    "jobDescription": "<div class=\"content-intro\">\n<p>Headway’s mission is a big one &#8211; to build a new mental health care system everyone can access. We’ve built technology that helps people find great therapists with the first software-enabled national network of providers accepting insurance.</p>\n<p>1 in 4 people in the US have a treatable mental health condition, but the majority of providers don’t accept insurance, making therapy too expensive for most people. Headway is building a new mental healthcare system that everyone can access by making it easy for therapists to take insurance and scale their practice.</p>\n<p>Headway was founded in 2019 – since then, we’ve grown into a diverse, national network of over 25,000 mental healthcare providers across all 50 states who run their practice on our software. We’re a Series C company with over $225m in funding from a16z (Andreessen Horowitz), Accel, GV (formerly Google Ventures), Spark Capital, Thrive Capital, and Health Care Service Corporation.</p>\n<p>We want your time here to be the most meaningful experience of your career. <strong>Join us, and help change mental healthcare for the better.</strong></p>\n</div>\n<h2><strong>About data at Headway:</strong></h2>\n<p>Building a new mental healthcare system at Headway is only possible because of the insights and leverage that data can provide. The data team at Headway is a small but mighty team designing the infrastructure, implementing pipelines, and driving the analytics and insights to build the mental healthcare system of the future (and have a fun time while doing it!). The Data team collaborates deeply with partner teams across the company to identify and drive areas for operational improvement, unlock key insights through infrastructure and data visibility, educate the company on data and how to become more data-driven, and uses technical expertise and science to solve the mental healthcare industry’s most challenging problems.</p>\n<h2>Functions of data at headway:</h2>\n<ul>\n<li><strong>Data Analytics</strong> deploys an understanding of our business and delivers insights to operate it more effectively.</li>\n<li><strong>Data Engineering</strong>: engineers the data infrastructure needed for analytics and data science.</li>\n<li><strong>Product Analytics</strong>: understands how users interact with our product so we can deliver better user experiences.</li>\n<li><strong>Science</strong>: Leverages Science and ML to power our intelligent therapist-matching, smart-survey technologies, and super charge other areas to deliver</li>\n</ul>\n<h2><strong>About the role:</strong></h2>\n<p>We are seeking a Senior Data Scientist to join our growing team and help drive our science and ML efforts at Headway. As an early member and leader, you will own key outcomes that involve the use of machine learning and data science. You will be responsible for bridging the gap between Data and Engineering to provide ML based solutions for Headway. You will also help shape the infrastructure that powers our ML solutions, and help shape the culture along the way. If you are a self-starter, comfortable with ambiguity and challenging problems, excited about building a data-driven culture, and motivated by making an impact, then you will be a good fit for this role.</p>\n<h2>Responsibilities:</h2>\n<p>Find opportunities to improve and enhance our technology products, and translate ambiguous business requirements into the right ML solutionResearch prior work to inform and develop models and algorithms and quantify appropriate metrics &amp; targetsLead research, development, and production deployment of machine learning solutions that support our patients, providers and insurance payers. Solve difficult data analysis problems by applying advanced analytical methods as neededCommunicate findings to technical collaborators and business stakeholders</p>\n<h2>What will make you successful:</h2>\n<ul>\n<li>PhD (OR Master&#8217;s Degree plus 3+ years of industry or academic research experience) in Industrial Engineering, Operations Research, Systems Engineering, Computer Science, Applied Mathematics, or a related field</li>\n<li>3+ years of experience building machine learning models or developing algorithms for business application</li>\n<li>Demonstrable work experience on models that have been deployed into production systems (strategic, planning, and/or operational, and other applicable areas)</li>\n<li>Experience in writing scripts (Python) and/or software applications in programming languages such as C++, Java</li>\n<li>Excellent communication skills with both technical and non-technical audiences</li>\n</ul>\n<h2><strong>Our Interview Process:</strong></h2>\n<p>After you apply to Headway, here are some details of what to expect during the interview process.</p>\n<ul>\n<li><strong>Initial screen</strong>: You’ll connect with someone in recruiting so you can learn more about the team, Headway’s mission and exciting growth, and we can get a better idea of your background.</li>\n<li><strong>First round</strong>: You&#8217;ll meet with the hiring manager and other team members for a skills overview and assessment.</li>\n<li><strong>Final rounds</strong>: You’ll showcase your advanced technical competencies</li>\n<li><strong>References and the Offer</strong>: Our favorite part of the process! We&#8217;ll send over all of the details, including specifics on employee equity, and congratulatory messages from excited future team members!</li>\n</ul>\n<h2><strong>Compensation and Benefits:</strong></h2>\n<ul>\n<li>Salary information is based on a single salary target per role:\n<ul>\n<li>The starting salary for a Senior Data Scientist is $195,500 based on industry tenure and experience.</li>\n</ul>\n</li>\n<li>Benefits offered include:\n<ul>\n<li>Equity Compensation</li>\n<li>Medical, Dental, and Vision coverage</li>\n<li>HSA / FSA</li>\n<li>401K</li>\n<li>Work-from-Home Stipend</li>\n<li>Therapy Reimbursement</li>\n<li>16-week parental leave for eligible employees</li>\n<li>Carrot Fertility annual reimbursement and membership</li>\n<li>13 paid holidays each year as well as a Holiday Break during the week between December 25th and December 31st</li>\n<li>Flexible PTO</li>\n<li>Employee Assistance Program (EAP)</li>\n<li>Training and professional development</li>\n</ul>\n</li>\n</ul>\n<div class=\"content-conclusion\">\n<p>We believe a team&#8217;s strength is in its people, and we cannot achieve this mission without a team that reflects the diversity of this problem &#8211; across race, ethnicity, gender, sexuality, age, national origin, religion, family status, disability, military status, and experience.</p>\n<p>Headway is committed to the full inclusion of all qualified individuals. As part of this commitment, Headway will ensure that persons with disabilities are provided with reasonable accommodations.</p>\n<div id=\"content\" class=\"\">\n<div class=\"content-conclusion\">\n<p>Headway employees work remotely across the US, with the option to work from offices in New York City and San Francisco. Headway participates in E-Verify.</p>\n</div>\n</div>\n</div>",
    "pubDate": "2024-09-11 08:31:18",
    "annualSalaryMin": "195500",
    "annualSalaryMax": "",
    "salaryCurrency": "USD",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda5fb"
    },
    "id": 106242,
    "url": "https://jobicy.com/jobs/106242-staff-software-engineer",
    "jobSlug": "106242-staff-software-engineer",
    "jobTitle": "Sr. Software Engineer, Editor Framework",
    "companyName": "Prezi",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/09/372fbf25d6bbb7ba24bc519fac29dbf9.jpeg",
    "jobIndustry": ["Software Engineering"],
    "jobType": ["full-time"],
    "jobGeo": "Europe",
    "jobLevel": "Senior",
    "jobExcerpt": "We’re looking for a software engineer to join our engineering team to help us build Prezi, a full-cycle presentation platform used by millions of people all over the world. Work with us to enable our users to create visually stunning presentations with the best possible visual editing experience for presentations with challenges such as spatial&#8230;",
    "jobDescription": "<p>We’re looking for a software engineer to join our engineering team to help us build Prezi, a full-cycle presentation platform used by millions of people all over the world.<br />\nWork with us to enable our users to create visually stunning presentations with the best possible visual editing experience for presentations with challenges such as spatial structuring and navigation.</p>\n<p>Prezi has a portfolio of three applications: Prezi Present, Prezi Design and Prezi Video. In this role you will work in a team developing the Editor of Prezi Present &#8211; our flagship presentation product &#8211; and some of the user flows and experiences around it.</p>\n<p>The Present Editor is built on a modular, plugin-based architecture that many teams in Prezi use to develop features for the Editor. Your job will be to extend and maintain this framework, and to integrate changes from other components (renderer, document access) into the application. The roadmap of the framework is greatly influenced by product needs, so besides Engineers, you will work closely with the team’s Product Manager, User Experience and Graphics Designer to prioritise new features and maintenance tasks. You will contribute high quality code to a complex codebase. You will ensure optimal user experience for presenters and their audiences, even when the application has to perform well under limited hardware resources and sometimes poor network conditions. With that, your impact will help millions of people build and deliver moving stories.</p>\n<p>As a software developer and part of a cross-functional team, you will be reporting to our Senior Engineering Manager, Ashutosh Jha.</p>\n<h2>If you</h2>\n<ul>\n<li>Have at least 5 years of software development experience in statically typed languages (such as C++, C#, Java, or TypeScript)</li>\n<li>Are interested and able to learn other coding languages as needed,</li>\n<li>Are self-driven with a sense of quality and a structured way of working,</li>\n<li>Have a strong product mindset</li>\n<li>Have good communication skills in English (with technical and non-technical team members and partner groups)</li>\n<li>Are self sufficient and have a high sense of ownership in your work,</li>\n</ul>\n<p>then we would love to talk to you!</p>\n<h2>Bonus points if you</h2>\n<ul>\n<li>Have a Master’s degree, further education or experience in engineering, computer science or another technical related field,</li>\n<li>Experience in developing systems where async communication, effective memory usage, and performance is important</li>\n</ul>\n<p>We offer a competitive salary, a culture where you can be yourself, flexible working hours in our beautiful office environment and remote work opportunities.<br />\nThe best part: you will join an awesome team who highly appreciates visual communication, who believes that together we are greater than the sum of our parts, and who deeply cares about those around us.</p>\n<p>At Prezi, we celebrate the diversity of our customers and our employees. We employ people from all backgrounds to build a product for everyone. We are looking for people who will bring in their different perspectives and help us on our mission to reinvent how people share knowledge, tell stories, and inspire their audiences to act.</p>\n<p>If you are into visual communication, love to be a part of a team and care about those around you, we encourage you to apply.</p>",
    "pubDate": "2024-09-11 08:30:41",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda5fc"
    },
    "id": 108415,
    "url": "https://jobicy.com/jobs/108415-presales-solution-consultant-healthcare",
    "jobSlug": "108415-presales-solution-consultant-healthcare",
    "jobTitle": "Account Executive, Enterprise",
    "companyName": "DocuSign",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/11/983c701912e42bba3cdb33a6c5893414.jpeg",
    "jobIndustry": ["Sales"],
    "jobType": ["full-time"],
    "jobGeo": "USA",
    "jobLevel": "Any",
    "jobExcerpt": "The Enterprise Account Executive cultivates and closes new Enterprise-level relationships, specifically within our West region, quarterbacking deals from start to finish. This role will be focused on building net-new relationships within greenfield accounts and expansion within these accounts thereafter. The ideal candidate will be curious by nature, a strategic hunter, and possess strong relationship-building skills&#8230;.",
    "jobDescription": "<p>The Enterprise Account Executive cultivates and closes new Enterprise-level relationships, specifically within our West region, quarterbacking deals from start to finish. This role will be focused on building net-new relationships within greenfield accounts and expansion within these accounts thereafter. The ideal candidate will be curious by nature, a strategic hunter, and possess strong relationship-building skills.</p>\n<p>You&#8217;ll work for the company who created DTM and leads the industry. You’ll sell products that you believe in, help introduce change to the way your customers live and work, work with competitive commission and stock plan structures that reward your efforts, and experience career growth and opportunity based on personal achievement.</p>\n<p>This position is an individual contributor role reporting to the Regional Vice President, Enterprise.</p>\n<h2><strong>Responsibility</strong></h2>\n<ul>\n<li>Drive success of the company’s goals and objectives through achieving individual sales quotas</li>\n<li>Build and manage a sales pipeline through prospecting efforts into a geographic territory or within the core verticals</li>\n<li>Develop and deliver customized sales presentations and products demonstrations, by phone and via online demo</li>\n<li>Develop and negotiate enterprise level proposals and contracts</li>\n<li>Forecast sales activity and revenue achievements accurately through proper use of sales tools</li>\n<li>Collaborate effectively and engage various pre/post sales resources including Sales Development Representatives, Market Development Representatives, Solutions Engineers, Account Managers, Partner Account Managers, as well as Legal, Security, Professional Services and Customer Support</li>\n</ul>\n<h2>Job Designation</h2>\n<p><strong>Remote: </strong>Employee is not required to be in or near an office frequentlyand works from a designated remote work location for the majority of thetime.</p>\n<p>Positions at Docusign are assigned a job designation of either In Office, Hybrid or Remote and are specific to the role/job. Preferred job designations are not guaranteed when changing positions within Docusign. Docusign reserves the right to change a position&#8217;s job designation depending on business needs and as permitted by local law.</p>\n<h2>What you bring</h2>\n<p><strong>Basic</strong></p>\n<ul>\n<li>BS/BA degree or equivalent experience</li>\n<li>8+ years of experience in an AE role or equivalent quota-carrying role</li>\n<li>Proficient computer application skills, including Salesforce.com, Microsoft Word, PowerPoint and Excel</li>\n<li>Familiar with Google suite</li>\n</ul>\n<p><strong>Preferred</strong></p>\n<ul>\n<li>7+ years SaaS sales experience</li>\n<li>Experience selling web-based products/services</li>\n<li>Experience managing and closing complex sales cycles</li>\n<li>Demonstrated ability to over-achieve quotas (top 10-20% of company) in past positions</li>\n<li>Based in Mountain or Pacific time zones</li>\n</ul>\n<h2>Wage Transparency</h2>\n<p>Pay for this position is based on a number of factors including geographic location and may vary depending on job-related knowledge, skills, and experience.</p>\n<p><strong>Based on applicable legislation, the below details pay ranges in the following locations:</strong></p>\n<p>California: $108,600.00 &#8211; $163,500.00 base salary<br />\nIllinois and Colorado: $106,400.00 &#8211; $154,325.00 base salary<br />\nWashington and New York (including NYC metro area): $106,400.00 &#8211; $157,425.00 base salary<br />\nWashington DC: $108,600.00 &#8211; $157,425.00 base salary</p>\n<p><strong>Global benefits provide options for the following:</strong></p>\n<ul>\n<li>Paid Time Off: earned time off, as well as paid company holidays based on region</li>\n<li>Paid Parental Leave: take up to six months off with your child after birth, adoption or foster care placement</li>\n<li>Full Health Benefits Plans: options for 100% employer paid and minimum employee contribution health plans from day one of employment</li>\n<li>Retirement Plans: select retirement and pension programs with potential for employer contributions</li>\n<li>Learning and Development: options for coaching, online courses and education reimbursements</li>\n<li>Compassionate Care Leave: paid time off following the loss of a loved one and other life-changing events</li>\n</ul>\n<h2>Life at Docusign</h2>\n<p>Docusign is committed to building trust and making the world more agreeable for our employees, customers and the communities in which we live and work. You can count on us to listen, be honest, and try our best to do what’s right, every day. At Docusign, everything is equal.</p>\n<p>We each have a responsibility to ensure every team member has an equal opportunity to succeed, to be heard, to exchange ideas openly, to build lasting relationships, and to do the work of their life. Best of all, you will be able to feel deep pride in the work you do, because your contribution helps us make the world better than we found it. And for that, you’ll be loved by us, our customers, and the world in which we live.</p>",
    "pubDate": "2024-09-11 08:29:13",
    "annualSalaryMin": "108600",
    "annualSalaryMax": "163500",
    "salaryCurrency": "USD",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda5fd"
    },
    "id": 107488,
    "url": "https://jobicy.com/jobs/107488-account-executive-enterprise",
    "jobSlug": "107488-account-executive-enterprise",
    "jobTitle": "Account Executive, Commercial",
    "companyName": "FullStory",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/03/Jobicy-210319095053-738582.jpg",
    "jobIndustry": ["Sales"],
    "jobType": ["full-time"],
    "jobGeo": "USA",
    "jobLevel": "Any",
    "jobExcerpt": "As a Commercial Account Executive, you will report to the Regional Vice President of Commercial Sales and be dedicated to driving Fullstory’s growth by adding new, delighted customers to our Commercial segment (Commercial at Fullstory is defined as customers with $80 million to $1.5 billion in annual revenue). To excel in this job, you’ll bring&#8230;",
    "jobDescription": "<p>As a Commercial Account Executive, you will report to the Regional Vice President of Commercial Sales and be dedicated to driving Fullstory’s growth by adding new, delighted customers to our Commercial segment (Commercial at Fullstory is defined as customers with $80 million to $1.5 billion in annual revenue).</p>\n<p>To excel in this job, you’ll bring exceptional prospecting skills coupled with the ability to drive value across a highly technical, complex sales cycle. The pace of Fullstory is fast and the landscape we’re playing in is ever-changing. We’re looking for someone who thrive when challenged and likes to work hard and have fun while doing it.</p>\n<h2><strong>In a typical day, you might:</strong></h2>\n<ul>\n<li>Own a territory where you are responsible for actively prospecting new business opportunities.</li>\n<li>Document and track all potential and existing client interactions and lead follow-through using Salesforce.</li>\n<li>Work cross-functionally with Sales Engineers, Product, and Customer Experience teams to provide in-depth technical demos and sell as a team.</li>\n<li>Lead sales presentations and product demonstrations with prospects and drive deals to close.</li>\n</ul>\n<h2><strong>Here&#8217;s what we&#8217;re looking for:</strong></h2>\n<ul>\n<li>2+ years of experience in full-cycle SaaS sales role.</li>\n<li>An average deal size of above $50K in the last 2 years</li>\n<li>A sales track record of proven success in the B2B SaaS space, exceeding individual quota of at least $800K USD.</li>\n<li>Experience running value-based, technical demonstrations in partnership with other departments.</li>\n</ul>\n<h2><strong>The impact you will have in 6 months:</strong></h2>\n<ul>\n<li>You are successfully sourcing and qualifying net-new business, bringing Fullstory’s behavioral data to market.</li>\n<li>You are successfully delivering value-driven sales presentations to customers of varying levels and personas.</li>\n</ul>\n<h2><strong>The impact you will have in 12 months:</strong></h2>\n<ul>\n<li> You will be fully ramped, consistently hitting or exceeding quarterly and annual quota targets.</li>\n<li>You have become a behavioral data expert and can successfully demonstrate the value of Fullstory to technical customers.</li>\n</ul>\n<h2><strong>About Fullstory:</strong></h2>\n<p>Fullstory is on a mission to help technology leaders make better, more informed decisions by injecting behavioral data into their analytics stack. The company’s patented technology unlocks the power of quality behavioral data at scale by transforming every digital visit into actionable data and insights. With Fullstory, enterprises can get closer to their customers’ true sentiment and intentions to predict what they want, create personalized experiences, and drive conversion, loyalty, and revenue. Fullstory is headquartered in Atlanta, USA, with regional teams across North America, EMEA and APAC.</p>\n<h2><strong>How we support you:</strong></h2>\n<p>Fullstorians are committed to building something better—from how we approach our product, to how we care for our customers and each other. Better is only possible when we can bring our full selves to work. Along these lines, we offer:</p>\n<ul>\n<li><strong>Autonomy and flexibility.</strong> From a remote-first work environment and flexible paid time off, to an annual company-wide closure – Fullstorians can focus on the moments that matter.</li>\n<li><strong>Benefits.</strong> Take care of the whole you. FullStory offers sponsored benefit packages for US-based Fullstorians, and supplemental coverage options for international Fullstorians.</li>\n<li><strong>Learning opportunities.</strong> We provide professional development opportunities through training programs, career coaching sessions, and an annual learning subsidy.</li>\n<li><strong>Productivity support.</strong> We provide all Fullstorians with a monthly productivity stipend and reimburse remote colleagues for their initial home office set up.</li>\n<li><strong>Team events.</strong> Connect with fellow Fullstorians through Employee Resource Group events, Listening &amp; Alignment weeks, and team off-sites.</li>\n<li><strong>Paid parental leave.</strong> Fullstorians have the flexibility to balance the needs of their growing families without the added stress of figuring out work and finances.</li>\n<li><strong>Grow your family. </strong>We offer a global fertility and family building benefit that encompasses all journeys to growing your family.</li>\n<li><strong>Bereavement leave.</strong> Every family is different; we leave it to you to define who your family is, and support you when you need it most.</li>\n<li><strong>Miscarriage/Pregnancy loss leave.</strong> Whether it is for a Fullstorian or their partner – take the time you need.</li>\n</ul>\n<p><em>Fullstory is proud to be an equal opportunity workplace dedicated to fostering an increasingly diverse community. We want candidates of all human varieties, backgrounds, and lifestyles. There’s no problem that can’t be made better by bringing together people with a broader set of perspectives. <strong>If our product, values, and community resonate with you, please apply &#8211; we&#8217;d love to hear from you!</strong></em></p>",
    "pubDate": "2024-09-11 08:26:58",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda5fe"
    },
    "id": 109491,
    "url": "https://jobicy.com/jobs/109491-staff-product-designer-trust-and-safety",
    "jobSlug": "109491-staff-product-designer-trust-and-safety",
    "jobTitle": "Staff Content Designer, Discovery and Belonging",
    "companyName": "Pinterest",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/01/86709a608bd914b28221164e6680ebf7.jpeg",
    "jobIndustry": ["Copywriting &amp; Content"],
    "jobType": ["full-time"],
    "jobGeo": "USA",
    "jobLevel": "Any",
    "jobExcerpt": "We’re on the lookout for a Content Designer to join the Pinterest Discovery team. As a Content Designer, you’re an advocate for Pinterest user experience, working to shape product experiences by creating useful, meaningful experiences that help users complete the task at hand and communicate in-product in the Pinterest voice. You help set the vision&#8230;",
    "jobDescription": "<p>We’re on the lookout for a Content Designer to join the Pinterest Discovery team. As a Content Designer, you’re an advocate for Pinterest user experience, working to shape product experiences by creating useful, meaningful experiences that help users complete the task at hand and communicate in-product in the Pinterest voice. You help set the vision for content and drive product narratives across Pinterest’s tools. You use language to design intuitive, delightful product experiences that make the Pinterest experience better.</p>\n<p>Our Discovery role will focus on the experiences of people using Pinterest everyday—helping people explore and discover new ideas, and using content design to find new ways to help people get inspired.</p>\n<p>You’re strategic and understand how to use content design to define product vision and narratives across multiple platforms. And as a Content Designer, you have a portfolio of work that demonstrates your gift for simplifying and improving user experiences.</p>\n<h2><strong>What you’ll do:</strong></h2>\n<ul>\n<li>Craft, write, edit, test and improve the content that makes our product easier to use &#8211; this includes product flows, UI language, in-product education, product naming and terminology, and navigation design</li>\n<li>Use empathy, logic and data to inform design choices</li>\n<li>Conduct audits, identify patterns, and lead brainstorming sessions to design the best content experiences</li>\n<li>Collaborate with researchers, product managers, engineers, marketing, and business stakeholders to establish conversational, cohesive experiences with a unified voice</li>\n<li>Become an expert in your product and user group ;tune in to research to learn about what your audience truly needs and bring human voices into problem statements and product UI</li>\n</ul>\n<h2><strong>What we’re looking for:</strong></h2>\n<ul>\n<li>5+ years of experience in user-focused product content design, with a focus on core audience experiences</li>\n<li>Experience shaping content for multi-disciplinary projects, with strong examples of information architecture design</li>\n<li>A portfolio demonstrating breadth and creativity and proven experience in content design, design thinking and product strategy</li>\n<li>Passion for building accessible, inclusive, quality products</li>\n</ul>\n<h2><strong>Relocation Statement:</strong></h2>\n<ul>\n<li>This position is not eligible for relocation assistance. Visit our PinFlex page to learn more about our working model.</li>\n</ul>\n<h2><strong>In-Office Requirement Statement:</strong></h2>\n<ul>\n<li>We let the type of work you do guide the collaboration style. That means we&#8217;re not always working in an office, but we continue to gather for key moments of collaboration and connection.</li>\n<li>This role will need to be in the office for in-person collaboration 1-2 times/half and therefore can be situated anywhere in the country.</li>\n</ul>\n<div>\n<div>\n<p>At Pinterest we believe the workplace should be equitable, inclusive, and inspiring for every employee. In an effort to provide greater transparency, we are sharing the base salary range for this position. The position is also eligible for equity. Final salary is based on a number of factors including location, travel, relevant prior experience, or particular skills and expertise.</p>\n</div>\n<div>US based applicants only $116,450—$240,000 USD</div>\n</div>\n<div>\n<h2><strong>Our Commitment to Diversity:</strong></h2>\n<div>Pinterest is an equal opportunity employer and makes employment decisions on the basis of merit. We want to have the best qualified people in every job. All qualified applicants will receive consideration for employment without regard to race, color, ancestry, national origin, religion or religious creed, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, age, marital status, status as a protected veteran, physical or mental disability, medical condition, genetic information or characteristics (or those of a family member) or any other consideration made unlawful by applicable federal, state or local laws. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements.</div>\n</div>",
    "pubDate": "2024-09-11 08:25:58",
    "annualSalaryMin": "116450",
    "annualSalaryMax": "240000",
    "salaryCurrency": "USD",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda5ff"
    },
    "id": 102733,
    "url": "https://jobicy.com/jobs/102733-korean-emerging-markets-account-executive",
    "jobSlug": "102733-korean-emerging-markets-account-executive",
    "jobTitle": "Bilingual Business Development Representative (Mandarin)",
    "companyName": "Toast",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/12/WRILS-201210114200-563401.png",
    "jobIndustry": ["Business Development", "Sales"],
    "jobType": ["full-time"],
    "jobGeo": "USA",
    "jobLevel": "Any",
    "jobExcerpt": "Toast is driven by building the restaurant platform that helps restaurants adapt, take control, and get back to what they do best: building the businesses they love. A Business Development Representative (BDR) will be responsible for creating new business sales opportunities for Toast. BDR&#8217;s will research restaurants in their assigned territory, create an outreach plan&#8230;",
    "jobDescription": "<div class=\"p-rich_text_section\">\n<div class=\"p-rich_text_section\">Toast is driven by building the restaurant platform that helps restaurants adapt, take control, and get back to what they do best: building the businesses they love. A Business Development Representative (BDR) will be responsible for creating new business sales opportunities for Toast. BDR&#8217;s will research restaurants in their assigned territory, create an outreach plan and determine how restaurants can benefit from leveraging Toast’s all in one digital platform. Daily outreach consists of cold calls, emails, and social media touch points. After consistent high performance in the role, BDR&#8217;s have the opportunity to pursue more advanced sales roles at Toast.</div>\n<h2 class=\"p-rich_text_section\"><strong>Responsibilities</strong></h2>\n<ul class=\"p-rich_text_list p-rich_text_list__bullet\">\n<li>Generate 2+ new business sales opportunities daily</li>\n<li>Complete 50+ outreach activities daily</li>\n<li>Research and prospect top/new restaurants in your territory</li>\n<li>Coordinate new business meetings with Territory Account Executives and/or Inside Sales Representatives</li>\n<li>Strategize with District Managers on their new business priorities</li>\n</ul>\n<h2 class=\"p-rich_text_section\"><strong>Requirements</strong></h2>\n<ul class=\"p-rich_text_list p-rich_text_list__bullet\">\n<li>Strong work ethic and determination to succeed</li>\n<li>Highly coachable and enjoys team collaboration</li>\n<li>Naturally curious and resourceful</li>\n<li>Previous Sales or Sales Internship Experience</li>\n<li><strong>Fully Bilingual in Mandarin Chinese</strong></li>\n</ul>\n<h2 class=\"p-rich_text_section\"><strong>Nonessential Skills/Nice to Haves</strong></h2>\n<ul class=\"p-rich_text_list p-rich_text_list__bullet\">\n<li>Collegiate Sales Competitors wanted!</li>\n<li>Restaurant Experience a plus</li>\n<li>Previous phone experience preferred</li>\n</ul>\n<h2><strong>Our Spread* of Total Rewards</strong></h2>\n<p>We strive to provide competitive compensation and benefits programs that help to attract, retain, and motivate the best and brightest people in our industry. Our total rewards package goes beyond great earnings potential and provides the means to a healthy lifestyle with the flexibility to meet Toasters’ changing needs. Learn more about our benefits at careers.toasttab.com/toast-benefits.</p>\n<p>*Bread puns encouraged but not required</p>\n<div class=\"content-pay-transparency\">\n<div class=\"pay-input\">\n<div class=\"description\">\n<p>The estimated Total Targeted Cash compensation range for this role is listed below. Total Targeted Cash for this role consists of a base salary, commission, plus the eligibility for equity and/or other benefits. This role qualifies for uncapped commissions. The starting salary will be determined based on skills, experience, and geographic location.</p>\n</div>\n<div class=\"title\">Total Targeted Cash $62,000—$99,000 USD</div>\n</div>\n</div>\n<div class=\"content-conclusion\">\n<h2><strong>We are Toasters</strong></h2>\n<p>Diversity, Equity, and Inclusion is Baked into our Recipe for Success.</p>\n<p>At Toast our employees are our secret ingredient. When they are powered to succeed, Toast succeeds.</p>\n<p>The restaurant industry is one of the most diverse industries. We embrace and are excited by this diversity, believing that only through authenticity, inclusivity, high standards of respect and trust, and leading with humility will we be able to achieve our goals.</p>\n<p>Baking inclusive principles into our company and diversity into our design provides equitable opportunities for all and enhances our ability to be first in class in all aspects of our industry.</p>\n</div>\n</div>",
    "pubDate": "2024-09-11 08:20:18",
    "annualSalaryMin": "62000",
    "annualSalaryMax": "99000",
    "salaryCurrency": "USD",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda600"
    },
    "id": 110606,
    "url": "https://jobicy.com/jobs/110606-tax-onboarding-specialist-i",
    "jobSlug": "110606-tax-onboarding-specialist-i",
    "jobTitle": "Tax Onboarding Specialist I",
    "companyName": "Toast",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/12/WRILS-201210114200-563401.png",
    "jobIndustry": ["Finance &amp; Legal"],
    "jobType": ["full-time"],
    "jobGeo": "USA",
    "jobLevel": "Any",
    "jobExcerpt": "The Tax Onboarding Specialist plays a critical role in helping customers make the switch onto the Toast Payroll platform.  Individuals in this role use their skills with data and specialized payroll tax expertise to ensure that our new customers experience a seamless, simple, and accurate first payroll and tax filing experience. The Tax Onboarding Specialist’s&#8230;",
    "jobDescription": "<p>The Tax Onboarding Specialist plays a critical role in helping customers make the switch onto the Toast Payroll platform.  Individuals in this role use their skills with data and specialized payroll tax expertise to ensure that our new customers experience a seamless, simple, and accurate first payroll and tax filing experience.</p>\n<p>The Tax Onboarding Specialist’s main duties include the transfer and validation of employee and pay data from a customer’s previous payroll provider onto the Toast Platform.  Individuals in this role will work closely with Onboarding Consultants to coordinate the extraction &amp; import of customer data at various points of a customer’s Onboarding Journey.  Tax Onboarding Specialists will need to validate the results of data imports against provided tax returns, investigate and resolve any discovered discrepancies, and conduct audits to ensure that each customer’s first payroll experience will be smooth and error-free.</p>\n<h2><strong>About this </strong><strong><em>roll</em></strong><strong>* (Responsibilities)</strong></h2>\n<ul>\n<li>Extract, manipulate, and import payroll and demographic data from legacy payroll providers</li>\n<li>Validate payroll and tax information between legacy system to Toast system</li>\n<li>Research and update data inconsistencies between two systems</li>\n<li>Setup new customers in our Tax Software to enable tax payment and filing</li>\n<li>Resolve complex payroll system and tax issues</li>\n<li>Complete projects with a high level of reliability and accuracy</li>\n<li>Autonomously and reliably manage projects and deadlines</li>\n</ul>\n<h2><strong>Do you have the right </strong><strong><em>ingredients*</em></strong><strong>? (Requirements)</strong></h2>\n<ul>\n<li>2+ years experience with handling large volumes of data, including data extraction, manipulation, and analysis.</li>\n<li>Proficient in Microsoft Excel and Google Suite (Vlookups, Pivot Tables, formulas, etc.)</li>\n<li>Proven track record in effectively organizing and prioritizing workload to meet deadlines</li>\n<li>Strong attention to detail, ensuring high-quality outputs and minimizing errors</li>\n<li>Success operating independently and navigating competing priorities in a constantly changing environment</li>\n<li>Bright, self-starter with a growth mindset</li>\n</ul>\n<h2><strong>Special Sauce* (Non-essential Skills/Nice to Haves)</strong></h2>\n<ul>\n<li>Knowledge of payroll processes or payroll taxes  experience</li>\n<li>Experience working with sensitive/confidential information</li>\n<li>Experience working in the tech industry or for a SAAS company</li>\n</ul>\n<h2><strong><em>Our Spread* of Total Rewards</em></strong></h2>\n<p>We strive to provide competitive compensation and benefits programs that help to attract, retain, and motivate the best and brightest people in our industry. Our total rewards package goes beyond great earnings potential and provides the means to a healthy lifestyle with the flexibility to meet Toasters’ changing needs. Learn more about our benefits at https://careers.toasttab.com/toast-benefits.</p>\n<p><strong><em>*Bread puns encouraged but not required</em></strong></p>\n<div class=\"content-pay-transparency\">\n<div class=\"pay-input\">\n<div class=\"description\">The starting pay rate for this role is below. Please note, there is not a range for this role, the number listed below is the rate.</div>\n<div class=\"title\">Pay Rate: $55,000—$55,000 USD</div>\n</div>\n</div>\n<div class=\"content-conclusion\">\n<h2><strong>We are Toasters</strong></h2>\n<p>Diversity, Equity, and Inclusion is Baked into our Recipe for Success.</p>\n<p>At Toast our employees are our secret ingredient. When they are powered to succeed, Toast succeeds.</p>\n<p>The restaurant industry is one of the most diverse industries. We embrace and are excited by this diversity, believing that only through authenticity, inclusivity, high standards of respect and trust, and leading with humility will we be able to achieve our goals.</p>\n<p>Baking inclusive principles into our company and diversity into our design provides equitable opportunities for all and enhances our ability to be first in class in all aspects of our industry.</p>\n</div>",
    "pubDate": "2024-09-11 08:20:09",
    "annualSalaryMin": "55000",
    "annualSalaryMax": "",
    "salaryCurrency": "USD",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda601"
    },
    "id": 106238,
    "url": "https://jobicy.com/jobs/106238-writer-capital-markets",
    "jobSlug": "106238-writer-capital-markets",
    "jobTitle": "Senior Writer - Capital Markets",
    "companyName": "Chainlink Labs",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/02/ec6e8f7f8fae8ec7d526de901c0a044a.jpeg",
    "jobIndustry": ["Copywriting &amp; Content"],
    "jobType": ["full-time"],
    "jobGeo": "Anywhere",
    "jobLevel": "Any",
    "jobExcerpt": "As the Writer for Capital Markets, you will be instrumental to Chainlink’s story in global markets. You will work within the Content Team to create, review, and amplify a wide range of media about Chainlink’s role in onchain finance and asset tokenization, from industry reports to partnership announcements to analyst briefings and beyond. You will&#8230;",
    "jobDescription": "<div class=\"section page-centered\" data-qa=\"job-description\">\n<div>As the Writer for Capital Markets, you will be instrumental to Chainlink’s story in global markets. You will work within the Content Team to create, review, and amplify a wide range of media about Chainlink’s role in onchain finance and asset tokenization, from industry reports to partnership announcements to analyst briefings and beyond. You will collaborate closely with a cross-functional team of writers, designers, video producers, product marketers, capital markets experts, and more. This is a career-defining opportunity to join one of the fastest-growing projects in the entire blockchain ecosystem and craft stories for global audiences about the future of finance.</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Objectives of this Role</h2>\n<ul>\n<li>Develop and maintain messaging guidelines around Chainlink’s position in the financial industry, including frameworks for Chainlink’s presence at industry events.</li>\n<li>Brainstorm, write, and promote financial industry-focused content, from partnership announcements with major institutions to original research to joint reports to animated explainers, podcast panels, and beyond.</li>\n<li>Ensure all financial industry content is on-brand, accurate, clear, and has been reviewed by key stakeholders in a timely manner.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Skills &amp; Qualifications</h2>\n<ul>\n<li>5+ years professional writing / content marketing / reporting / analyst experience.</li>\n<li>Professional experience in the finance industry, working with or reporting on financial institutions, with a deep understanding of use cases around financial market infrastructure, asset issuance and management, central banks, and more.</li>\n<li>Exceptional writing, editing, and communication skills.</li>\n<li>Professional experience conducting original research and analysis.</li>\n<li>Strong understanding of the blockchain industry.</li>\n<li>Ability to translate complex technical concepts and technologies into strategic business and customer-centric value propositions.</li>\n<li>Self-starter who truly enjoys working in a fast-paced, innovative start-up environment where change is constant.</li>\n<li>Strong organizational skills to manage multiple projects with tight deadlines effectively.</li>\n</ul>\n</div>\n</div>\n<div class=\"section page-centered\">\n<div>\n<h2>Preferred Qualifications</h2>\n<ul>\n<li>Experience with podcasting/video podcasting</li>\n<li>Experience writing about finance on social media, such as LinkedIn and Twitter</li>\n<li>Experience running a financial newsletter, such as a brand account or personal Substack</li>\n</ul>\n<div><i>All roles with Chainlink Labs are global and remote-based. Unless otherwise stated, we ask that you try to overlap some working hours with Eastern Standard Time (EST). We encourage you to apply regardless of your location. </i></div>\n</div>\n</div>",
    "pubDate": "2024-09-11 08:16:34",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda602"
    },
    "id": 110605,
    "url": "https://jobicy.com/jobs/110605-senior-android-engineer-3",
    "jobSlug": "110605-senior-android-engineer-3",
    "jobTitle": "Senior Android Engineer",
    "companyName": "Lime",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/10/WRILS-201021162422-999778.png",
    "jobIndustry": ["Software Engineering"],
    "jobType": ["full-time"],
    "jobGeo": "Canada",
    "jobLevel": "Senior",
    "jobExcerpt": "We are looking for an experienced Android Engineer to join our team and help us revolutionize the way people move around cities. As a key member of our team, you’ll have the opportunity to design and build the core technology that powers our fleet of connected vehicles. With our rapid global expansion, you’ll play a&#8230;",
    "jobDescription": "<p>We are looking for an experienced Android Engineer to join our team and help us revolutionize the way people move around cities. As a key member of our team, you’ll have the opportunity to design and build the core technology that powers our fleet of connected vehicles. With our rapid global expansion, you’ll play a vital role in crafting backend systems that can process boatloads of requests from our IoT devices and consumer-facing apps. You will also have the chance to improve our suite of operational tools that enable our distributed workforce to charge, deploy, and maintain our electric vehicles. And the best part? You get an opportunity to work with a talented group of engineers, data scientists, designers and PMs who are passionate about creating innovative solutions for urban transportation!</p>\n<h2>What You&#8217;ll Do:</h2>\n<ul>\n<li>Identify, define, and solve strategically essential technical problems, including architecting and building highly scalable foundational platforms, leading new product initiatives, and revamping core application experiences.</li>\n<li>Scrutinize and reason clearly about the technology and architecture choices we make. In many cases, you will be the decider of these decisions.</li>\n<li>Lead the cross-functional collaboration with PMs, Engineers, Design, Data Scientists, Research, and Operations teams.</li>\n<li>Mentor and lead other engineers on the team. Identify and develop future leaders.</li>\n<li>Advise Lime’s leadership team on key technology adoption and process improvements.</li>\n<li>Contribute to shaping overall engineering culture at the company.</li>\n</ul>\n<h2>About You:</h2>\n<ul>\n<li>6+ years of industry professional software development experience, and a track record of building impactful products or systems.</li>\n<li>Strong background and proven leadership in mobile development.</li>\n<li>Dynamic, driven and hands-on, yet capable to multitask across functions.</li>\n<li>Experience with mobile testing frameworks and services.</li>\n<li>iOS development experience. (bonus)</li>\n<li>Passionate. You’re passionate about Lime&#8217;s mission and micro mobility; you want to see cities transform to becoming people-centric and less polluted.</li>\n</ul>\n<p>Equity and benefits may be provided as part of the compensation package, depending on the position offered. Not all candidates will be eligible for the upper end of the salary range. Exact salary will ultimately depend on multiple factors, which may include the candidate’s location of residence, the successful candidate&#8217;s skills, experience and other qualifications. In addition to base salary, some roles may be eligible for a variable bonus based on a combination of company performance, employee performance, and management discretion.</p>",
    "pubDate": "2024-09-11 08:15:34",
    "annualSalaryMin": "126000",
    "annualSalaryMax": "174000",
    "salaryCurrency": "USD",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda603"
    },
    "id": 105038,
    "url": "https://jobicy.com/jobs/105038-staff-software-engineer-south-america",
    "jobSlug": "105038-staff-software-engineer-south-america",
    "jobTitle": "Staff Back-End Engineer (South America)",
    "companyName": "Varsity Tutors",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/03/Jobicy-210313085850-559044.jpg",
    "jobIndustry": ["Software Engineering"],
    "jobType": ["full-time"],
    "jobGeo": "LATAM",
    "jobLevel": "Any",
    "jobExcerpt": "We are looking for a Back-End Staff Software Engineer (Full-Time Contractor) based in South America to join us on our mission to help people learn! This is a great opportunity to work with an amazing team and drive the technology of learning products and platforms. We operate in a highly collaborative environment with Product and&#8230;",
    "jobDescription": "<p class=\"\">We are looking for a Back-End Staff Software Engineer (Full-Time Contractor) based in South America to join us on our mission to help people learn!</p>\n<p class=\"\">This is a great opportunity to work with an amazing team and drive the technology of learning products and platforms. We operate in a highly collaborative environment with Product and Design to build experiences that matter to our customers. At Nerdy, engineers do not just write code; they actively participate in the conversation on what and how to build the systems and solutions that matter to our customers. If you love your customers as much as we do, we&#8217;d love to hear from you.</p>\n<p class=\"\">The Staff Engineer will assume a dual role as a technical leader and a visionary for our highly complex and high-performing systems. In this capacity, they will not only provide technical guidance and mentorship to the team but also play a pivotal role in shaping and driving the overarching vision of our system, aimed at enhancing the experience for our tutors and optimizing our tutor-supply chain.</p>\n<p class=\"\">This position is a full-time remote opportunity. (We&#8217;ve been remote-friendly for years, and that isn&#8217;t going away.)</p>\n<h2><strong>About the Team: </strong></h2>\n<p class=\"\">The Engagement team owns our student customer-facing systems, including our digital classroom and learning tools &#8211; the experiences that students learn in. If you want to have direct, meaningful impact on our customers’ learning this is the place! You will architect scalable software solutions, understand and implement best practices, and create technology that is highly performant and extensible.</p>\n<h2><strong>About Nerdy:</strong></h2>\n<p class=\"\">Nerdy (NYSE: NRDY), the parent company of Varsity Tutors, is a leading platform for live online learning, with a mission to transform the way people learn through technology. The Company’s purpose-built proprietary platform leverages technology, including Machine Learning and AI (Nerdy AI Learning Products &#8211; Press Release), to connect learners of all ages to experts, delivering superior value on both sides of the network. Nerdy’s comprehensive learning destination provides learning experiences across 3,000+ subjects and multiple formats—including one-on-one instruction, small group classes, large format group classes, on-demand study support, and adaptive self-study. Nerdy’s flagship business, Varsity Tutors, is one of the nation’s largest platforms for live online tutoring and classes. Its solutions are available directly to students and consumers, as well as through schools and other institutions.</p>\n<h2><strong>Key Responsibilities</strong></h2>\n<ul>\n<li>Technical Leadership: Serve as the technical point of reference for the squad and broader engineering team, ensuring best practices and architectural standards are upheld.</li>\n<li>Solution Design: Lead the design and architectural discussions, making pivotal decisions on technologies, frameworks, and design patterns.</li>\n<li>Code Quality: Advocate for and ensure the delivery of high-quality, maintainable, and scalable code. Conduct regular code reviews and provide mentorship to team members.</li>\n<li>Collaboration: Work closely with product managers, designers, and other stakeholders to understand requirements, provide technical insights, and ensure the timely delivery of features.</li>\n<li>Strategy and Vision: Contribute to the engineering department&#8217;s strategy and vision, bringing innovative ideas to improve our customer-facing experiences.</li>\n<li>Problem Solving: Address complex technical challenges, innovate solutions, and optimize existing systems for scalability and performance.</li>\n<li>Team Development: Mentor and develop team members, helping them to grow in their technical roles and careers.</li>\n</ul>\n<h2><strong>Qualifications: </strong></h2>\n<ul>\n<li>Minimum of 10 years of software engineering experience with a proven track record of working on complex systems.</li>\n<li>Experience with one of our core languages: Go, Ruby, Python &#8211; with a strong preference for Go.</li>\n<li>Explicit mentoring of senior-level engineers regularly, leading to results.</li>\n<li>Significant experience in AWS or GCP-based cloud architecture environments.</li>\n<li>In-depth knowledge of modern software engineering practices, design patterns, and architectures.</li>\n<li>Ability to communicate complex technical concepts clearly to both technical and non-technical stakeholders.</li>\n<li>Demonstrated experience in collaborating with multidisciplinary teams.</li>\n<li>Excellent problem-solving and analytical skills.</li>\n<li>A strong owner willing to roll up their sleeves. This role includes coding and reviewing the code of others.</li>\n<li>Ability to implement customer-facing solutions that solve the customers’ true needs.</li>\n<li>Nerdy is an apolitical company focused solely on helping people learn, and we achieve the most when united in this mission.</li>\n</ul>\n<h2><strong>Benefits:</strong></h2>\n<ul>\n<li>Competitive USD salary.</li>\n<li>Remote position.</li>\n<li>Hackfest! (Multiple times per year).</li>\n<li>Free Learning Membership for you and your household (1-1 tutoring hours, unlimited use of on-demand services, and access to our online classes).</li>\n<li>A once-in-a-lifetime opportunity to help transform how the world learns!</li>\n<li>A fun, collaborative, and team-oriented work environment with plenty of training and a feedback-rich culture.</li>\n</ul>\n<h2><strong>Nerdy Leadership Principles</strong></h2>\n<p class=\"\">Relentless Focus on Customers * Comfort with Ambiguity * Ownership * Simplify * Intellectual Curiosity * Build Teams * Think Big * Insist on High Standards * Bias for Action * Build Trust * Go Deep * Have Conviction * Deliver Results * Are Right, a Lot</p>\n<p class=\"\"><em>Nerdy is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</em></p>",
    "pubDate": "2024-09-11 08:12:25",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda604"
    },
    "id": 106237,
    "url": "https://jobicy.com/jobs/106237-senior-customer-retention-manager",
    "jobSlug": "106237-senior-customer-retention-manager",
    "jobTitle": "Customer Retention Manager",
    "companyName": "Varsity Tutors",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/03/Jobicy-210313085850-559044.jpg",
    "jobIndustry": ["Sales"],
    "jobType": ["full-time"],
    "jobGeo": "USA",
    "jobLevel": "Any",
    "jobExcerpt": "Varsity Tutors is seeking a Customer Retention Manager to join our team! The Customer Retention Manager will have a direct impact on business growth as we help more people achieve their academic goals and help us continue our national expansion. The individual in this role will lead a team of customer retention professionals and is&#8230;",
    "jobDescription": "<p>Varsity Tutors is seeking a Customer Retention Manager to join our team! The Customer Retention Manager will have a direct impact on business growth as we help more people achieve their academic goals and help us continue our national expansion. The individual in this role will lead a team of customer retention professionals and is responsible for the hiring, management, development, and performance of the team. They will lead and develop a talented customer retention team that assesses needs, renews learning memberships, strengthens client relations, and provides high-quality service to our clients. The individual in this role will work directly with other customer retention leaders and company executives and will have a direct impact on the ongoing strategies and growth of the company.</p>\n<h2><strong>Qualifications</strong></h2>\n<ul>\n<li>Demonstrated results and effective at building teams</li>\n<li>3+ years of customer retention, client relations, or customer success experience</li>\n<li>Strong leadership qualities with the ability to coach, develop and motivate a team</li>\n<li>Experience developing retention plans and analyzing metrics</li>\n<li>Demonstrated ability to implement and train teams in strategic and effective retention techniques</li>\n<li>Experience in hiring, developing, and managing a high-performing retention team</li>\n<li>Ability to work independently and prioritize work</li>\n<li>Ability to work some evenings and weekends</li>\n</ul>\n<h2><strong>Responsibilities</strong></h2>\n<ul>\n<li>Hire and effectively on-board high-performing customer retention specialists</li>\n<li>Continually coach and develop staff to ensure success and improved results, and implement performance plans</li>\n<li>Manage day-to-day performance of all team members and deliver performance reviews</li>\n<li>Hit all performance targets for number of renewals, conversion rates, customer satisfaction, and others as determined by company</li>\n<li>Assess and understand the needs of our clients</li>\n<li>Work with leadership to generate ideas for motivational initiatives</li>\n<li>Lead and schedule weekly team meetings</li>\n<li>Embody company culture and maintain high employee engagement</li>\n<li>Ensure correct usage of CRM and other company used technology and platforms</li>\n</ul>\n<p><strong>Nerdy Leadership Principles: </strong>Relentless Focus on Customers * Comfort with Ambiguity * Ownership * Simplify * Intellectual Curiosity * Build Teams * Think Big * Insist on High Standards * Bias for Action * Build Trust * Go Deep * Have Conviction * Deliver Results * Are Right, a Lot</p>\n<h2><strong>Benefits:</strong></h2>\n<ul>\n<li>Competitive Base Salary and Variable compensation (performance bonuses) plus Equity in the company</li>\n<li>Healthcare Plans (Medical, Dental, Vision, Life)</li>\n<li>401k Company Matching Plan (No Vesting Period)</li>\n<li>PTO and Company Holidays</li>\n<li>Remote work environment</li>\n<li>Maternity, Paternal, and Adoption Leave</li>\n<li>Free Learning Membership for you and your household (1-1 tutoring hours, unlimited use of on-demand services, and access to our online classes)</li>\n<li>Once-in-a-lifetime opportunity to help transform how the world learns!</li>\n<li>Fun, collaborative, and team-oriented work environment with plenty of training and a feedback-rich culture</li>\n</ul>\n<p><em>Nerdy is committed to creating a diverse environment and is proud to be an equal-opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.</em></p>",
    "pubDate": "2024-09-11 08:12:10",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda605"
    },
    "id": 110604,
    "url": "https://jobicy.com/jobs/110604-senior-marketing-analyst",
    "jobSlug": "110604-senior-marketing-analyst",
    "jobTitle": "Senior Marketing Analyst",
    "companyName": "Life360",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2022/02/f269bad3-221.jpeg",
    "jobIndustry": ["Marketing &amp; Sales"],
    "jobType": ["full-time"],
    "jobGeo": "Canada,  USA",
    "jobLevel": "Senior",
    "jobExcerpt": "The Data &amp; Analytics team is a centralized team of Data professionals which includes Analytics, Data Engineering and Data Science. While belonging to a close-knit team of fellow data professionals, each Life360 Analyst will partner with one or more business units within the company on a long-term basis, contributing as a thought leader, establishing domain&#8230;",
    "jobDescription": "<p>The Data &amp; Analytics team is a centralized team of Data professionals which includes Analytics, Data Engineering and Data Science. While belonging to a close-knit team of fellow data professionals, each Life360 Analyst will partner with one or more business units within the company on a long-term basis, contributing as a thought leader, establishing domain expertise and developing cross-functional relationships while collaborating to solve business problems with our data.</p>\n<h2>About the Job</h2>\n<p>Life360 is looking for an experienced Marketing Analyst to join our team. The successful candidate will partner with Marketing leaders to leverage data, analytics and insights to drive new marketing opportunities with Brand, Personas and Lifecycle Marketing teams. An ideal candidate will leverage both their technical expertise and prior Marketing experience to: drive new sales and brand marketing campaigns, test and optimize improvements to the customer journey, design outreach experiments and collaborate with Marketing managers to gain new insights into our users.</p>\n<p><strong><em>For candidates based in the US, the salary range for this position is $130,000 to $170,000 USD. For candidates based in Canada, the salary range for this position is 138,000 to 165,000 CAD. </em></strong><em>We take into consideration an individual&#8217;s background and experience in determining final salary- therefore, base pay offered may vary considerably depending on geographic location, job-related knowledge, skills, and experience. The compensation package includes a wide range of medical, dental, vision, financial, and other benefits, as well as equity.</em></p>\n<h2>What You’ll Do</h2>\n<ul>\n<li>Drive the creation of key performance indicators, data collection techniques, reporting, and analyses that measure the performance of Growth Marketing and Lifecycle Marketing campaigns.</li>\n<li>Distill user insights and campaign analyses into cohesive narratives and presentations for presentation across the company.</li>\n<li>Advise marketing teams (mobile, web, online/offline advertising, brand, product development) as the knowledge “go to” resource for marketing data.</li>\n<li>Partner closely with the Data Engineering team to provide thought leadership and detailed requirements for data needs.</li>\n<li>Utilize data visualization tools (e.g., Tableau, Power BI) to create interactive and user-friendly reports.</li>\n<li>Develop/implement models to improve marketing measurement, attribution and spend optimization</li>\n</ul>\n<h2>What We’re Looking For</h2>\n<ul>\n<li>5+ years as a Marketing Data Analyst with marketing and paid user acquisition data and analytics experience in consumer internet, mobile app, or digital product firm.</li>\n<li>Demonstrated implementation and utilization of user tracking, click stream event platforms, and other paid audience analytics technologies. (Amplitude, Google Analytics, Appsflyer)</li>\n<li>Strong hands on data wrangling and reporting experience with large and complex data sets utilizing SQL, Python / R or equivalent using cloud data technologies like Redshift, Athena, and Snowflake..</li>\n<li>Experience in delivering enterprise Data and Business Intelligence reporting. (Quicksight, Tableau, Qlick, Looker, or equivalent)</li>\n<li>Experience gathering, distilling, and providing requirements to technical engineering and data teams.</li>\n<li>Demonstrated project management and organizational skills.</li>\n<li>Excellent verbal, presentation, and written communication skills</li>\n<li>Degree in Computer Science, Statistics, Informatics, Information Systems or another quantitative field.</li>\n</ul>\n<h2>Our Benefits</h2>\n<ul>\n<li>Competitive pay and benefits</li>\n<li>Medical, dental, vision, life and disability insurance plans (100% paid for US employees). We offer supplemental plans for medical and dental for Canadian employees</li>\n<li>401(k) plan with company matching program in the US and RRSP with DPSP plan for Canadian employees</li>\n<li>Employee Assistance Program (EAP) for mental wellness.</li>\n<li>Flexible PTO and 12 company wide days off throughout the year</li>\n<li>Learning &amp; Development programs</li>\n<li>Equipment, tools, and reimbursement support for a productive remote environment</li>\n<li>Free Life360 Platinum Membership for your preferred circle</li>\n</ul>\n<h2>Life360 Values</h2>\n<p>Our company’s mission driven culture is guided by our shared values to create a trusted work environment where you can bring your authentic self to work and make a positive difference</p>\n<ul>\n<li>Be a Good Person &#8211; We have a team of high integrity people you can trust.</li>\n<li>Be Direct With Respect &#8211; We communicate directly, even when it’s hard.</li>\n<li>Members Before Metrics &#8211; We focus on building an exceptional experience for families.</li>\n<li>High Intensity High Impact &#8211; We do whatever it takes to get the job done.</li>\n</ul>\n<h2>Our Commitment to Diversity</h2>\n<p>We believe that different ideas, perspectives and backgrounds create a stronger and more creative work environment that delivers better results. Together, we continue to build an inclusive culture that encourages, supports, and celebrates the diverse voices of our employees. It fuels our innovation and connects us closer to our customers and the communities we serve. We strive to create a workplace that reflects the communities we serve and where everyone feels empowered to bring their authentic best selves to work.</p>\n<p><em>We are an equal opportunity employer and value diversity at Life360. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, disability status or any legally protected status.  </em></p>\n<p><em>We encourage people of all backgrounds to apply. We believe that a diversity of perspectives and experiences create a foundation for the best ideas. Come join us in building something meaningful.</em><strong><em> </em></strong><em>Even if you don’t meet 100% of the below qualifications, you should still seriously consider applying!</em></p>",
    "pubDate": "2024-09-11 08:07:37",
    "annualSalaryMin": "130000",
    "annualSalaryMax": "170000",
    "salaryCurrency": "USD",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda606"
    },
    "id": 109517,
    "url": "https://jobicy.com/jobs/109517-account-manager-2",
    "jobSlug": "109517-account-manager-2",
    "jobTitle": "Enterprise Sales Lead",
    "companyName": "Scroll.io",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2023/07/105078d294d30c978ca2badf7f376934.jpg",
    "jobIndustry": ["Sales"],
    "jobType": ["full-time"],
    "jobGeo": "Anywhere",
    "jobLevel": "Any",
    "jobExcerpt": "The Enterprise Sales Lead will be responsible for developing and executing a strategic enterprise sales plan to drive new business for Scroll.io. Reporting to the Head of Growth, this role will focus on identifying and securing new enterprise clients, positioning Scroll.io’s innovative blockchain solutions as essential to their success. The ideal candidate will have a strong SaaS&#8230;",
    "jobDescription": "<p>The Enterprise Sales Lead will be responsible for developing and executing a strategic enterprise sales plan to drive new business for Scroll.io. Reporting to the Head of Growth, this role will focus on identifying and securing new enterprise clients, positioning Scroll.io’s innovative blockchain solutions as essential to their success. The ideal candidate will have a strong SaaS background and experience in selling enterprise services, with a deep understanding of how to craft and implement strategies that meet the needs of large-scale organizations.</p>\n<h2><strong>Key Responsibilities:</strong></h2>\n<ul>\n<li><strong>Strategic Sales Planning:</strong>Develop and lead the implementation of a comprehensive enterprise sales strategy that targets high-value enterprise clients and drives new revenue growth. This includes setting clear objectives, identifying key markets, and creating actionable plans to achieve sales goals.</li>\n<li><strong>New Business Development:</strong>Identify and pursue new enterprise sales opportunities by leveraging your industry knowledge, network, and strategic thinking. Focus on opening doors to new clients, securing large-scale deals, and expanding Scroll.io’s presence within the enterprise sector.</li>\n<li><strong>Sales Strategy Execution:</strong>Translate strategic plans into executable sales tactics. This involves crafting compelling value propositions, customizing sales approaches for different industry verticals, and ensuring that Scroll.io’s solutions are presented effectively to decision-makers at target organizations.</li>\n<li><strong>Pipeline Management:</strong>Build and manage a robust sales pipeline, ensuring a steady flow of new business opportunities. Use CRM tools to track progress, forecast outcomes, and report on sales metrics regularly to the Head of Growth and executive team.</li>\n<li><strong>Relationship Building:</strong>While the primary focus is on new sales, you will also be responsible for building strong, lasting relationships with key enterprise clients. Ensure these relationships lead to long-term partnerships and repeat business opportunities.</li>\n<li><strong>Sales Leadership:</strong>Provide leadership and guidance to a growing sales team, ensuring they are motivated and equipped to achieve their sales targets. Collaborate closely with the Head of Growth to align team efforts with broader company objectives.</li>\n</ul>\n<h2><strong>Requirements:</strong></h2>\n<ul>\n<li>Proven experience in a senior enterprise sales role, with a strong background in SaaS and enterprise services and/or solutions.</li>\n<li>Demonstrated success in developing and executing strategic sales plans that drive significant new business.</li>\n<li>Exceptional communication and negotiation skills, with the ability to articulate complex issues clearly and persuasively to enterprise stakeholders.</li>\n<li>Ability to analyze market data and trends to inform sales strategies and tactics.</li>\n<li>Willingness to travel for enterprise client meetings and industry events.</li>\n</ul>\n<h2><strong>Nice to Haves:</strong></h2>\n<ul>\n<li>Experience working in startups or high-growth environments.</li>\n<li>Deep engagement and awareness of the latest enterprise technology trends.</li>\n<li>Active on platforms like LinkedIn and other professional networks.</li>\n<li>Public speaking experience and the ability to represent Scroll.io at industry events.</li>\n</ul>\n<h2><strong>About You</strong></h2>\n<ul>\n<li>You are a self-starter and ability to take ownership, well organised, self-disciplined and effective when working autonomously on tasks and projects;</li>\n<li>You are responsive, collaborative and committed person with a high work ethic;</li>\n<li>You are a high class communicator who can articulate their views succinctly on calls or asynchronously in globally distributed, remote teams;</li>\n<li>You relish working in an agile start-up environment;</li>\n<li>You are a great listener who understands when to listen first and engages well with colleagues;</li>\n<li>You are a resilient, driven individual who is willing and able to continually develop and iterate to succeed;</li>\n</ul>\n<h2><strong>What We Offer</strong></h2>\n<ul>\n<li>A mission-led, collaborative culture</li>\n<li>Opportunity to work with cutting edge technology and like-minded people who are contributing to the progression of Ethereum</li>\n<li>Competitive salary package / generous paid time off / annual growth budget</li>\n<li>100% remote from any location with flexible hours</li>\n<li>Home office set up / co-working membership allowance</li>\n<li>Private healthcare in selected countries</li>\n</ul>\n<p><em>Scroll is proud to be an equal opportunity workplace. We are committed to equal employment opportunities regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, or Veteran status. If you have a disability or special need, please let us know and we&#8217;ll do our best to accommodate.</em></p>",
    "pubDate": "2024-09-11 08:04:19",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda607"
    },
    "id": 74392,
    "url": "https://jobicy.com/jobs/74392-product-owner-ux",
    "jobSlug": "74392-product-owner-ux",
    "jobTitle": "Designer - Product",
    "companyName": "Revolut",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2020/08/FNDL-200825111113-468175.png",
    "jobIndustry": ["Design &amp; Creative", "Product &amp; Operations"],
    "jobType": ["full-time"],
    "jobGeo": "Europe",
    "jobLevel": "Any",
    "jobExcerpt": "People deserve more from their money. More visibility, more control, more freedom. And since 2015, Revolut has been on a mission to deliver just that. With an arsenal of awesome products that span spending, saving, travel, transfers, investing, exchanging and more, our super app has helped 35+ million customers get more from their money. And&#8230;",
    "jobDescription": "<p>People deserve more from their money. More visibility, more control, more freedom. And since 2015, Revolut has been on a mission to deliver just that. With an arsenal of awesome products that span spending, saving, travel, transfers, investing, exchanging and more, our super app has helped 35+ million customers get more from their money. And we&#8217;re not done yet.</p>\n<p>As we continue our lightning-fast growth,‌ two things are essential to continuing our success: our people and our culture. We&#8217;ve been officially certified as a Great Place to Work™ in recognition of our outstanding employee experience! So far, we have 8,000+ people working around the world, from our great offices or remotely, on our mission. And we&#8217;re looking for more. We want brilliant people that love building great products, love redefining success, and love turning the complexity of a chaotic world into the simplicity of a beautiful solution.</p>\n<h2>About the role</h2>\n<p>We approach Design at Revolut the same way that we approach everything else. We love building great products. We love delighting our customers. We love turning the complexity of a chaotic world into the simplicity of a beautiful solution that truly solves customer needs </p>\n<p>Our Design team knows the magic! Those wizards look into a crystal ball and get a holistic view on the user experience  With all their wisdom they lead the design processes from discovery to delivery, always keeping in mind our customers and their interests </p>\n<p>You feel what we’re talking about here, right? If yes ➡️ ➡️ you can be Junior Mage, you can be Senior Mage, you can be not sure about which Product team to join  Sorting Hat is passe, but we&#8217;d love to simply talk and discover together what would suit you better.</p>\n<p>We say hocus, you say pocus, and the teleport to our Design team gets open! </p>\n<h2>What you’ll be doing</h2>\n<ul>\n<li>Partnering with the Product Owners, Engineers, Data Scientists, and other colleagues, working in a cross-functional and distributed team. Together, you will be actively involved in defining the customers’ and the business’ problems</li>\n<li>Identifying the key metrics for the projects you are involved in and take ownership for achieving their success</li>\n<li>Researching and bringing forward new findings and learnings for reaching complex company goals &#8211; such as launching in new territories and offering new products</li>\n<li>From wwire-framing to designing end-to-end flows and prototypes, you will be in charge of designing products that solve problems in a simple and elegant way while taking care of every small detail</li>\n<li>We love turning the complexity of a chaotic world into the simplicity of a beautiful solution that truly solves customer needs, thus you will be running user testing workshops and guerrilla testing</li>\n<li>Once that’s done, iterate, implement with the technical team and present the final solution during the design reviews</li>\n<li>We are not stopping here, we believe in continuous improvement, so you’ll review the performance of the release, identify learnings and find ways to enhance it</li>\n<li>To ensure we are speaking the same language as a team, we have the support of a design system &#8211; so you’ll kick in!</li>\n</ul>\n<h2>What you&#8217;ll need</h2>\n<ul>\n<li>2+ years of experience in designing world-class complex commercial apps in-house</li>\n<li>A portfolio featuring examples of product design work</li>\n<li>Strong design skills across iOS, Android and web platforms</li>\n<li>The ability to think at a high level about product strategy and clearly articulate design decisions</li>\n<li>The ability to understand technical implications in their design decisions</li>\n<li>The ability to take ownership of design process and work as self-directed member of the development team</li>\n<li>Strong UX focus and understanding of human behaviour</li>\n<li>Clean visual design sense</li>\n<li>Skills in typography and grids</li>\n<li>Love to solve problems and be challenged</li>\n<li>To be a constant learner. You will be always growing &#8211; both personally and with the team</li>\n</ul>\n<h2>Nice to have</h2>\n<ul>\n<li>Technical higher education: BS/MS in Computer Science or a related field</li>\n<li>Some experience in programming and ability to code simple prototypes</li>\n<li>Experience in designing and maintaining cross-platform design systems</li>\n<li>Experience working in fast-paced startup environment</li>\n</ul>\n<h2>Compensation range</h2>\n<ul>\n<li>Vilnius: €3,500 &#8211; €5,300 gross monthly*</li>\n<li>Lithuania: €3,500 &#8211; €5,300 gross monthly*</li>\n<li>Other locations: Compensation will be discussed during the interview process</li>\n</ul>\n<p>*Final compensation will be determined based on the candidate&#8217;s qualifications, skills, and previous experience</p>",
    "pubDate": "2024-09-11 08:01:51",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  },
  {
    "_id": {
      "$oid": "66e3bd39e1e7d47047dda608"
    },
    "id": 110575,
    "url": "https://jobicy.com/jobs/110575-copywriter-3",
    "jobSlug": "110575-copywriter-3",
    "jobTitle": "Copywriter",
    "companyName": "Cella",
    "companyLogo": "https://jobicy.com/data/server-nyc0409/galaxy/mercury/2021/11/9ab52695ce05458b27c838bbb1774730.jpeg",
    "jobIndustry": ["Copywriting &amp; Content"],
    "jobType": ["contract"],
    "jobGeo": "Anywhere",
    "jobLevel": "Any",
    "jobExcerpt": "We&#8217;re seeking a talented Copywriter to join our client&#8217;s dynamic team! As a Copywriter, you&#8217;ll be responsible for developing captivating copy across various marketing channels. From social media posts to print materials, you&#8217;ll play a pivotal role in communicating our client&#8217;s brand message effectively. Additionally, you&#8217;ll collaborate closely with the team to generate innovative ideas for campaigns&#8230;",
    "jobDescription": "<p>We&#8217;re seeking a talented <strong>Copywriter</strong> to join our client&#8217;s dynamic team!</p>\n<p>As a Copywriter, you&#8217;ll be responsible for developing captivating copy across various marketing channels. From social media posts to print materials, you&#8217;ll play a pivotal role in communicating our client&#8217;s brand message effectively. Additionally, you&#8217;ll collaborate closely with the team to generate innovative ideas for campaigns and projects. The ideal candidate has a passion for words, a knack for creativity, and a drive to exceed expectations.</p>\n<h2><strong>Responsibilities:</strong></h2>\n<ul>\n<li>Collaborate with Graphic Designers, Marketers, and other team members to develop creative solutions that align with business objectives.</li>\n<li>Craft compelling copy for diverse mediums, including social media, websites, emails, digital ads, and more.</li>\n<li>Maintain consistency with our brand voice and contribute to the development of our style guide.</li>\n<li>Stay informed about industry trends and competitors, providing insights to the team as needed.</li>\n<li>Adapt to character limitations and design constraints, working closely with editors to refine your writing.</li>\n<li>Assist in quality assurance processes to ensure accurate implementation of copy.</li>\n<li>Identify and address inconsistencies in writing guidelines, enhancing overall quality.</li>\n<li>Apply best practices for digital products and technologies.</li>\n<li>Actively participate in meetings, seeking clarity and contributing ideas to improve outcomes.</li>\n<li>Foster positive relationships with team members and external partners.</li>\n</ul>\n<h2><strong>Qualifications:</strong></h2>\n<ul>\n<li>Experience level: Experienced</li>\n<li>Bachelor&#8217;s degree in Journalism, Creative Writing, Advertising, or a related field, with at least 1 year of copywriting experience OR 3 years of copywriting experience.</li>\n<li>2 years of experience in copywriting for an ecommerce brand.</li>\n<li>1 year of experience working for or with creative agencies.</li>\n<li>1 year of experience developing copy concepts in a retail or marketing environment.</li>\n<li>Ability to work independently and collaboratively.</li>\n<li>Strong work ethic and willingness to go above and beyond.</li>\n<li>A great sense of humor is a bonus!</li>\n</ul>\n<p>Equal Opportunity Employer: Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.</p>\n<p>At Cella, a randstad digital company, we welcome people of all abilities and want to ensure that our hiring and interview process meets the needs of all applicants.</p>",
    "pubDate": "2024-09-10 08:22:55",
    "lastModified": {
      "$date": "2024-10-12T07:11:26.692Z"
    }
  }
]
